Grasshopper API
GH_AsynchFileData.RemoteUpdatePeriod Field
 Specifies the number of milliseconds in between periodic checks for files on network drives.
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public const int RemoteUpdatePeriod = 10000
Public Const RemoteUpdatePeriod As Integer = 10000
Field Value
Type: Int32
See Also
Reference
GH_AsynchFileData Class
Grasshopper.GUI Namespace