Grasshopper API
ID.Equals Method
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool Equals(
	ID other
)
Public Function Equals (
	other As ID
) As Boolean
Parameters
other
Type: GH_IO.Serialization.ID
Return Value
Type: Boolean
Implements
IEquatable<T>.Equals(T)
See Also
Reference
ID Structure
GH_IO.Serialization Namespace