Grasshopper API
GH_Chunk.ChunkKeyedCollection.Remove Method (GH_Chunk)
 Namespace: GH_IO.Serialization
 Assembly: GH_IO (in GH_IO.dll)
Syntax
public bool Remove(
	GH_Chunk chunk
)
Public Function Remove (
	chunk As GH_Chunk
) As Boolean
Parameters
chunk
Type: GH_IO.Serialization.GH_Chunk
Return Value
Type: Boolean
See Also
Reference
GH_Chunk.ChunkKeyedCollection Class
Remove Overload
GH_IO.Serialization Namespace