Grasshopper API
GH_Surface.LoadGeometry Method
Overload List
Name | Description
LoadGeometry(RhinoDoc) |  (Overrides GH_GeometricGoo<T>.LoadGeometry(RhinoDoc).)
Top
See Also
Reference
GH_Surface Class
Grasshopper.Kernel.Types Namespace