Grasshopper API
GH_CapsuleRenderEngine.GetPaletteStyle Method
Overload List
Name | Description
GetPaletteStyle(GH_Palette, IGH_Attributes) |  Obsolete.
GetPaletteStyle(GH_Palette, Boolean, Boolean, Boolean) |  Obsolete.
Top
See Also
Reference
GH_CapsuleRenderEngine Class
Grasshopper.GUI.Canvas Namespace