Grasshopper API
GH_YakDownloadFormEto.Item.Version Property
 Namespace: Grasshopper.GUI
 Assembly: Grasshopper (in Grasshopper.dll)
Syntax
public string Version { get; set; }
Public Property Version As String
	Get
	Set
Property Value
Type: String
[Missing <value> documentation for "P:Grasshopper.GUI.GH_YakDownloadFormEto.Item.Version"]
See Also
Reference
GH_YakDownloadFormEto.Item Class
Grasshopper.GUI Namespace