Public Types | Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_SubDComponentPtr Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Types
enum  | Type : unsigned char { Type::Unset = 0, Type::Vertex = 2, Type::Edge = 4, Type::Face = 6 }
ON_SubDComponentPtr::Type identifies the type of subdivision component referenced by the ON_SubDComponentPtr. More...
 Public Member Functions
const ON_BoundingBox  | BoundingBox (ON_SubDComponentLocation subd_appearance, const class ON_SubD &subd) const
const ON_3dPoint  | CenterPoint (ON_SubDComponentLocation subd_appearance) const
const ON_SubDComponentPtr  | ClearComponentDirection () const
bool  | ClearMark () const
ON__UINT8  | ClearMarkBits () const
unsigned int  | ClearStates (ON_ComponentStatus states_to_clear)
class ON_SubDComponentBase *  | ComponentBase () const
ON__UINT_PTR  | ComponentDirection () const
unsigned int  | ComponentId () const
const ON_COMPONENT_INDEX  | ComponentIndex () const
ON_SubDComponentPtr::Type  | ComponentType () const
const ON_BoundingBox  | ControlNetBoundingBox () const
const ON_3dPoint  | ControlNetCenterPoint () const
class ON_SubDEdge *  | Edge () const
const ON_SubDEdgePtr  | EdgePtr () const
class ON_SubDFace *  | Face () const
const ON_SubDFacePtr  | FacePtr () const
ON__UINT16  | Hash16FromTypeAndId () const
ON__UINT32  | Hash32FromPointer () const
bool  | IsActive () const
bool  | IsNotNull () const
bool  | IsNull () const
bool  | Mark () const
ON__UINT8  | MarkBits () const
const ON_SubDComponentPtr  | Reversed () const
const ON_SubDComponentPtr  | SetComponentDirection () const
const ON_SubDComponentPtr  | SetComponentDirection (ON__UINT_PTR dir) const
bool  | SetMark () const
bool  | SetMark (bool bMark) const
ON__UINT8  | SetMarkBits (ON__UINT8 mark_bits) const
unsigned int  | SetStates (ON_ComponentStatus states_to_set)
unsigned int  | SetStatus (ON_ComponentStatus status)
const ON_ComponentStatus  | Status () const
const ON_wString  | ToString () const
wchar_t *  | ToString (wchar_t *s, size_t s_capacity) const
class ON_SubDVertex *  | Vertex () const
const ON_SubDVertexPtr  | VertexPtr () const
 Static Public Member Functions
static int  | CompareComponent (const ON_SubDComponentPtr *a, const ON_SubDComponentPtr *b)
static int  | CompareComponentAndDirection (const ON_SubDComponentPtr *a, const ON_SubDComponentPtr *b)
static int  | CompareComponentPtrType (ON_SubDComponentPtr::Type a, ON_SubDComponentPtr::Type b)
static int  | CompareType (const ON_SubDComponentPtr *a, const ON_SubDComponentPtr *b)
static ON_SubDComponentPtr::Type  | ComponentPtrTypeFromUnsigned (unsigned int component_pointer_type_as_unsigned)
static const ON_SubDComponentPtr  | Create (const class ON_SubDEdge *edge)
static const ON_SubDComponentPtr  | Create (const class ON_SubDEdge *edge, ON__UINT_PTR edge_direction)
static const ON_SubDComponentPtr  | Create (const class ON_SubDFace *face)
static const ON_SubDComponentPtr  | Create (const class ON_SubDFace *face, ON__UINT_PTR face_direction)
static const ON_SubDComponentPtr  | Create (const class ON_SubDVertex *vertex)
static const ON_SubDComponentPtr  | Create (const class ON_SubDVertex *vertex, ON__UINT_PTR vertex_direction)
static const ON_SubDComponentPtr  | Create (ON_SubDEdgePtr edgeptr)
static const ON_SubDComponentPtr  | Create (ON_SubDFacePtr faceptr)
static const ON_SubDComponentPtr  | Create (ON_SubDVertexPtr vertexptr)
static const ON_SubDComponentPtr  | CreateNull (ON_SubDComponentPtr::Type component_type, ON__UINT_PTR component_direction)
 Public Attributes
ON__UINT_PTR  | m_ptr
 Static Public Attributes
static const ON_SubDComponentPtr  | Null
// nullptr, type = unset, mark = 0 More...
Member Enumeration Documentation
◆ Type
 enum ON_SubDComponentPtr::Type : unsigned char
strong
ON_SubDComponentPtr::Type identifies the type of subdivision component referenced by the ON_SubDComponentPtr.
Enumerator
Unset
Vertex
Edge
Face
Member Function Documentation
◆ BoundingBox()
 const ON_BoundingBox ON_SubDComponentPtr::BoundingBox  |  ( |  ON_SubDComponentLocation  |  subd_appearance,
|  const class ON_SubD &  |  subd
) |   |  const
◆ CenterPoint()
 const ON_3dPoint ON_SubDComponentPtr::CenterPoint  |  ( |  ON_SubDComponentLocation  |  subd_appearance | ) |   const
◆ ClearComponentDirection()
 const ON_SubDComponentPtr ON_SubDComponentPtr::ClearComponentDirection  |  ( |   | ) |   const
Returns: An ON_SubDComponentPtr referencing the same ON_SubDComponentBase with ON_SubDComponentPtr.ComponentDirection() = 0.
◆ ClearMark()
 bool ON_SubDComponentPtr::ClearMark  |  ( |   | ) |   const
Description: Clears (sets to false) the value of the component mark. Remarks: SubD components have a mutable runtime mark that can be used in any context where a single thread cares about the marks. It is widely used in many calculations to keep track of sets of components that are in a certain context specfic state. Returns: Input value of Mark().
◆ ClearMarkBits()
 ON__UINT8 ON_SubDComponentPtr::ClearMarkBits  |  ( |   | ) |   const
◆ ClearStates()
 unsigned int ON_SubDComponentPtr::ClearStates  |  ( |  ON_ComponentStatus  |  states_to_clear | )
Returns: 1: status changed. 0: status not changed.
◆ CompareComponent()
 static int ON_SubDComponentPtr::CompareComponent  |  ( |  const ON_SubDComponentPtr *  |  a,
|  const ON_SubDComponentPtr *  |  b
)
static
Description: Dictionary compares type and ComponentBase() pointer as an unsigned.
◆ CompareComponentAndDirection()
 static int ON_SubDComponentPtr::CompareComponentAndDirection  |  ( |  const ON_SubDComponentPtr *  |  a,
|  const ON_SubDComponentPtr *  |  b
)
static
Description: Dictionary compares type, ComponentBase() pointer as an unsigned, and ComponentDirection().
◆ CompareComponentPtrType()
 static int ON_SubDComponentPtr::CompareComponentPtrType  |  ( |  ON_SubDComponentPtr::Type  |  a,
|  ON_SubDComponentPtr::Type  |  b
)
static
Description: ON_SubDComponentPtr::Type::Vertex < ON_SubDComponentPtr::Type::Edge < ON_SubDComponentPtr::Type::Face < ON_SubDComponentPtr::Type::Unset < invalid
◆ CompareType()
 static int ON_SubDComponentPtr::CompareType  |  ( |  const ON_SubDComponentPtr *  |  a,
|  const ON_SubDComponentPtr *  |  b
)
static
◆ ComponentBase()
 class ON_SubDComponentBase* ON_SubDComponentPtr::ComponentBase  |  ( |   | ) |   const
◆ ComponentDirection()
 ON__UINT_PTR ON_SubDComponentPtr::ComponentDirection  |  ( |   | ) |   const
Returns: 0 or 1. A runtime bit property on this ON_SubDComponentPtr. The use of this value varies depending on the context. Frequently, 0 means the referenced component is being used with its natural orientation and 1 means the referenced component is being used with the reverse of its natrual oreientation.
◆ ComponentId()
 unsigned int ON_SubDComponentPtr::ComponentId  |  ( |   | ) |   const
◆ ComponentIndex()
 const ON_COMPONENT_INDEX ON_SubDComponentPtr::ComponentIndex  |  ( |   | ) |   const
◆ ComponentPtrTypeFromUnsigned()
 static ON_SubDComponentPtr::Type ON_SubDComponentPtr::ComponentPtrTypeFromUnsigned  |  ( |  unsigned int  |  component_pointer_type_as_unsigned | )
static
◆ ComponentType()
 ON_SubDComponentPtr::Type ON_SubDComponentPtr::ComponentType  |  ( |   | ) |   const
◆ ControlNetBoundingBox()
 const ON_BoundingBox ON_SubDComponentPtr::ControlNetBoundingBox  |  ( |   | ) |   const
◆ ControlNetCenterPoint()
 const ON_3dPoint ON_SubDComponentPtr::ControlNetCenterPoint  |  ( |   | ) |   const
◆ Create() [1/9]
 static const ON_SubDComponentPtr ON_SubDComponentPtr::Create  |  ( |  const class ON_SubDEdge *  |  edge | )
static
◆ Create() [2/9]
 static const ON_SubDComponentPtr ON_SubDComponentPtr::Create  |  ( |  const class ON_SubDEdge *  |  edge,
|  ON__UINT_PTR  |  edge_direction
)
static
◆ Create() [3/9]
 static const ON_SubDComponentPtr ON_SubDComponentPtr::Create  |  ( |  const class ON_SubDFace *  |  face | )
static
◆ Create() [4/9]
 static const ON_SubDComponentPtr ON_SubDComponentPtr::Create  |  ( |  const class ON_SubDFace *  |  face,
|  ON__UINT_PTR  |  face_direction
)
static
◆ Create() [5/9]
 static const ON_SubDComponentPtr ON_SubDComponentPtr::Create  |  ( |  const class ON_SubDVertex *  |  vertex | )
static
◆ Create() [6/9]
 static const ON_SubDComponentPtr ON_SubDComponentPtr::Create  |  ( |  const class ON_SubDVertex *  |  vertex,
|  ON__UINT_PTR  |  vertex_direction
)
static
◆ Create() [7/9]
 static const ON_SubDComponentPtr ON_SubDComponentPtr::Create  |  ( |  ON_SubDEdgePtr  |  edgeptr | )
static
◆ Create() [8/9]
 static const ON_SubDComponentPtr ON_SubDComponentPtr::Create  |  ( |  ON_SubDFacePtr  |  faceptr | )
static
◆ Create() [9/9]
 static const ON_SubDComponentPtr ON_SubDComponentPtr::Create  |  ( |  ON_SubDVertexPtr  |  vertexptr | )
static
◆ CreateNull()
 static const ON_SubDComponentPtr ON_SubDComponentPtr::CreateNull  |  ( |  ON_SubDComponentPtr::Type  |  component_type,
|  ON__UINT_PTR  |  component_direction
)
static
◆ Edge()
 class ON_SubDEdge* ON_SubDComponentPtr::Edge  |  ( |   | ) |   const
◆ EdgePtr()
 const ON_SubDEdgePtr ON_SubDComponentPtr::EdgePtr  |  ( |   | ) |   const
◆ Face()
 class ON_SubDFace* ON_SubDComponentPtr::Face  |  ( |   | ) |   const
◆ FacePtr()
 const ON_SubDFacePtr ON_SubDComponentPtr::FacePtr  |  ( |   | ) |   const
◆ Hash16FromTypeAndId()
 ON__UINT16 ON_SubDComponentPtr::Hash16FromTypeAndId  |  ( |   | ) |   const
Returns: A value suitable for hash table used based on the component type and id.
◆ Hash32FromPointer()
 ON__UINT32 ON_SubDComponentPtr::Hash32FromPointer  |  ( |   | ) |   const
Returns: A value suitable for hash table used based on the value of ComponentBase().
◆ IsActive()
 bool ON_SubDComponentPtr::IsActive  |  ( |   | ) |   const
Returns: True if this component is active in its parent subd or other relevent context. Remarks: When a component is in use, IsActive() = true. If was used and then deleted, IsActive() is false.
◆ IsNotNull()
 bool ON_SubDComponentPtr::IsNotNull  |  ( |   | ) |   const
Returns: True if type is set and ComponentBase() pointer is not nullptr. Note that mark may be set as well.
◆ IsNull()
 bool ON_SubDComponentPtr::IsNull  |  ( |   | ) |   const
Returns: True if the ComponentBase() pointer is nullptr. Note that type and mark may be set.
◆ Mark()
 bool ON_SubDComponentPtr::Mark  |  ( |   | ) |   const
Returns: The current value of the component mark ( m_status->RuntimeMark() ). Remarks: SubD components have a mutable runtime mark that can be used in any context where a single thread cares about the marks. It is widely used in many calculations to keep track of sets of components that are in a certain context specfic state.
◆ MarkBits()
 ON__UINT8 ON_SubDComponentPtr::MarkBits  |  ( |   | ) |   const
◆ Reversed()
 const ON_SubDComponentPtr ON_SubDComponentPtr::Reversed  |  ( |   | ) |   const
Returns: An ON_SubDComponentPtr referencing the same ON_SubDComponentBase with ComponentDirection() = 1 - this->ComponentDirection().
◆ SetComponentDirection() [1/2]
 const ON_SubDComponentPtr ON_SubDComponentPtr::SetComponentDirection  |  ( |   | ) |   const
Returns: An ON_SubDComponentPtr referencing the same ON_SubDComponentBase with ON_SubDComponentPtr.ComponentDirection() = 1.
◆ SetComponentDirection() [2/2]
 const ON_SubDComponentPtr ON_SubDComponentPtr::SetComponentDirection  |  ( |  ON__UINT_PTR  |  dir | ) |   const
Returns: An ON_SubDComponentPtr referencing the same ON_SubDComponentBase with ON_SubDComponentPtr.ComponentDirection() = 1.
◆ SetMark() [1/2]
 bool ON_SubDComponentPtr::SetMark  |  ( |   | ) |   const
Description: Sets (sets to true) the value of the component mark. Remarks: SubD components have a mutable runtime mark that can be used in any context where a single thread cares about the marks. It is widely used in many calculations to keep track of sets of components that are in a certain context specfic state. Returns: Input value of Mark().
◆ SetMark() [2/2]
 bool ON_SubDComponentPtr::SetMark  |  ( |  bool  |  bMark | ) |   const
Description: Sets the value of the component mark to bMark. Parameter: bMark - [in] Remarks: SubD components have a mutable runtime mark that can be used in any context where a single thread cares about the marks. It is widely used in many calculations to keep track of sets of components that are in a certain context specfic state. Returns: Input value of Mark().
◆ SetMarkBits()
 ON__UINT8 ON_SubDComponentPtr::SetMarkBits  |  ( |  ON__UINT8  |  mark_bits | ) |   const
◆ SetStates()
 unsigned int ON_SubDComponentPtr::SetStates  |  ( |  ON_ComponentStatus  |  states_to_set | )
Returns: 1: status changed. 0: status not changed.
◆ SetStatus()
 unsigned int ON_SubDComponentPtr::SetStatus  |  ( |  ON_ComponentStatus  |  status | )
Description: Makes "this" an exact copy of status. Parameters: status - [in] Returns: 1: status changed. 0: status not changed.
◆ Status()
 const ON_ComponentStatus ON_SubDComponentPtr::Status  |  ( |   | ) |   const
◆ ToString() [1/2]
 const ON_wString ON_SubDComponentPtr::ToString  |  ( |   | ) |   const
◆ ToString() [2/2]
 wchar_t* ON_SubDComponentPtr::ToString  |  ( |  wchar_t *  |  s,
|  size_t  |  s_capacity
) |   |  const
◆ Vertex()
 class ON_SubDVertex* ON_SubDComponentPtr::Vertex  |  ( |   | ) |   const
◆ VertexPtr()
 const ON_SubDVertexPtr ON_SubDComponentPtr::VertexPtr  |  ( |   | ) |   const
Member Data Documentation
◆ m_ptr
 ON__UINT_PTR ON_SubDComponentPtr::m_ptr
For performance reasons, m_ptr is not initialized and no constructors are declared or implemented. If you require initialization, then use x = ON_SubDComponentPtr::Null or x = ON_SubDComponentPtr::Create(...).
◆ Null
 const ON_SubDComponentPtr ON_SubDComponentPtr::Null
static
// nullptr, type = unset, mark = 0