Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_Interval Class Reference
OpenNURBS
#include <opennurbs_point.h>
 Public Member Functions
ON_Interval ()
The default constructor creates ON_Interval::EmptyInterval (ON_UNSET_VALUE,ON_UNSET_VALUE) More...
ON_Interval (const ON_Interval &)=default
ON_Interval (double t0, double t1)
~ON_Interval ()=default
void  | Destroy ()
bool  | Expand (double delta)
bool  | Includes (const ON_Interval &other, bool bProperSubSet=false) const
bool  | Includes (double t, bool bTestOpenInterval=false) const
bool  | Intersection (const ON_Interval &)
bool  | Intersection (const ON_Interval &, const ON_Interval &)
bool  | IsDecreasing () const
returns true if m_t[0] > m_t[0]; More...
bool  | IsEmptyInterval () const
returns true if m_t[0] == m_t[1] == ON_UNSET_VALUE More...
bool  | IsEmptySet () const
returns true if m_t[0] == m_t[1] == ON_UNSET_VALUE More...
bool  | IsIncreasing () const
returns true if m_t[0] < m_t[1] More...
bool  | IsInterval () const
returns truc if m_t[0] != m_t[1] More...
bool  | IsSingleton () const
returns true if m_t[0] == m_t[1] != ON_UNSET_VALUE More...
bool  | IsValid () const
returns ON_IsValid(m_t[0]) && ON_IsValid(m_t[1]) More...
double  | Length () const
returns signed length, m_t[1]-m_t[0] More...
bool  | MakeIncreasing ()
returns true if resulting interval IsIncreasing() More...
double  | Max () const
returns larger of m_t[0] and m_t[1] More...
double  | Mid () const
returns 0.5*(m_t[0] + m_t[1]) More...
double  | Min () const
returns smaller of m_t[0] and m_t[1] More...
double  | NormalizedParameterAt (double interval_parameter) const
ON_Interval  | NormalizedParameterAt (ON_Interval interval_parameter) const
bool  | operator!= (const ON_Interval &rhs) const
ON_Interval &  | operator= (const ON_Interval &)=default
bool  | operator== (const ON_Interval &rhs) const
double &  | operator[] (int)
returns (index<=0) ? m_t[0] : m_t[1] More...
double  | operator[] (int) const
returns (index<=0) ? m_t[0] : m_t[1] More...
double &  | operator[] (unsigned int)
returns (index<=0) ? m_t[0] : m_t[1] More...
double  | operator[] (unsigned int) const
returns (index<=0) ? m_t[0] : m_t[1] More...
double  | ParameterAt (double normalized_parameter) const
ON_Interval  | ParameterAt (ON_Interval normalized_interval) const
void  | Reverse ()
void  | Set (double t0, double t1)
void  | Swap ()
bool  | Union (const ON_Interval &)
bool  | Union (const ON_Interval &, const ON_Interval &)
bool  | Union (double t)
bool  | Union (int count, const double *t)
 Static Public Member Functions
static int  | Compare (const ON_Interval &lhs, const ON_Interval &rhs)
static bool  | IntervalsOverlap (const ON_Interval &A, const ON_Interval &B)
static const ON_Interval  | Singleton (double t)
 Public Attributes
double  | m_t [2]
Interval = (m_t[0], m_t[1]) More...
 Static Public Attributes
static const ON_Interval  | EmptyInterval
(ON_UNSET_VALUE,ON_UNSET_VALUE) More...
static const ON_Interval  | Nan
(ON_DBL_QNAN,ON_DBL_QNAN) More...
static const ON_Interval  | ZeroToOne
(0.0, 1.0) More...
static const ON_Interval  | ZeroToTwoPi
(0.0, 2.0*ON_PI) More...
Detailed Description
ON_Interval