Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_SubDFacePtr Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
bool  | ClearMark () const
ON__UINT8  | ClearMarkBits () const
class ON_SubDFace *  | Face () const
ON__UINT_PTR  | FaceDirection () const
unsigned int  | FaceEdgeCount () const
unsigned int  | FaceId () const
bool  | IsActive () const
bool  | IsNotNull () const
bool  | IsNull () const
bool  | Mark () const
ON__UINT8  | MarkBits () const
const ON_SubDFacePtr  | Reversed () const
bool  | SetMark () const
bool  | SetMark (bool bMark) const
ON__UINT8  | SetMarkBits (ON__UINT8 mark_bits) const
const ON_ComponentStatus  | Status () const
 Static Public Member Functions
static int  | Compare (const ON_SubDFacePtr *lhs, const ON_SubDFacePtr *rhs)
static int  | CompareFacePointer (const ON_SubDFacePtr *lhs, const ON_SubDFacePtr *rhs)
static const ON_SubDFacePtr  | Create (const class ON_SubDComponentPtr &face_component)
static const ON_SubDFacePtr  | Create (const class ON_SubDFace *face, ON__UINT_PTR direction)
 Public Attributes
ON__UINT_PTR  | m_ptr
 Static Public Attributes
static const ON_SubDFacePtr  | Null
Member Function Documentation
◆ ClearMark()
 bool ON_SubDFacePtr::ClearMark  |  ( |   | ) |   const
Description: Clears (sets to false) the value of the component mark. Remarks: SubD components have a mutable runtime mark that can be used in any context where a single thread cares about the marks. It is widely used in many calculations to keep track of sets of components that are in a certain context specfic state. Returns: Input value of Mark().
◆ ClearMarkBits()
 ON__UINT8 ON_SubDFacePtr::ClearMarkBits  |  ( |   | ) |   const
◆ Compare()
 static int ON_SubDFacePtr::Compare  |  ( |  const ON_SubDFacePtr *  |  lhs,
|  const ON_SubDFacePtr *  |  rhs
)
static
◆ CompareFacePointer()
 static int ON_SubDFacePtr::CompareFacePointer  |  ( |  const ON_SubDFacePtr *  |  lhs,
|  const ON_SubDFacePtr *  |  rhs
)
static
◆ Create() [1/2]
 static const ON_SubDFacePtr ON_SubDFacePtr::Create  |  ( |  const class ON_SubDComponentPtr &  |  face_component | )
static
◆ Create() [2/2]
 static const ON_SubDFacePtr ON_SubDFacePtr::Create  |  ( |  const class ON_SubDFace *  |  face,
|  ON__UINT_PTR  |  direction
)
static
◆ Face()
 class ON_SubDFace* ON_SubDFacePtr::Face  |  ( |   | ) |   const
◆ FaceDirection()
 ON__UINT_PTR ON_SubDFacePtr::FaceDirection  |  ( |   | ) |   const
◆ FaceEdgeCount()
 unsigned int ON_SubDFacePtr::FaceEdgeCount  |  ( |   | ) |   const
Returns: If Face() is not nullptr, Face()->EdgeCount() is returned. Otherwise, 0 is returned.
◆ FaceId()
 unsigned int ON_SubDFacePtr::FaceId  |  ( |   | ) |   const
Returns: If Face() is not nullptr, Face()->m_id is returned. Otherwise, 0 is returned.
◆ IsActive()
 bool ON_SubDFacePtr::IsActive  |  ( |   | ) |   const
Returns: True if this face is active in its parent subd or other relevent context. Remarks: When a component is in use, IsActive() = true. If was used and then deleted, IsActive() is false.
◆ IsNotNull()
 bool ON_SubDFacePtr::IsNotNull  |  ( |   | ) |   const
◆ IsNull()
 bool ON_SubDFacePtr::IsNull  |  ( |   | ) |   const
◆ Mark()
 bool ON_SubDFacePtr::Mark  |  ( |   | ) |   const
Returns: The current value of the component mark ( m_status->RuntimeMark() ). Remarks: SubD components have a mutable runtime mark that can be used in any context where a single thread cares about the marks. It is widely used in many calculations to keep track of sets of components that are in a certain context specfic state.
◆ MarkBits()
 ON__UINT8 ON_SubDFacePtr::MarkBits  |  ( |   | ) |   const
◆ Reversed()
 const ON_SubDFacePtr ON_SubDFacePtr::Reversed  |  ( |   | ) |   const
Returns: A ON_SubDFacePtr pointing at the same face with the direction reversed from this.
◆ SetMark() [1/2]
 bool ON_SubDFacePtr::SetMark  |  ( |   | ) |   const
Description: Sets (sets to true) the value of the component mark. Remarks: SubD components have a mutable runtime mark that can be used in any context where a single thread cares about the marks. It is widely used in many calculations to keep track of sets of components that are in a certain context specfic state. Returns: Input value of Mark().
◆ SetMark() [2/2]
 bool ON_SubDFacePtr::SetMark  |  ( |  bool  |  bMark | ) |   const
Description: Sets the value of the component mark to bMark. Parameter: bMark - [in] Remarks: SubD components have a mutable runtime mark that can be used in any context where a single thread cares about the marks. It is widely used in many calculations to keep track of sets of components that are in a certain context specfic state. Returns: Input value of Mark().
◆ SetMarkBits()
 ON__UINT8 ON_SubDFacePtr::SetMarkBits  |  ( |  ON__UINT8  |  mark_bits | ) |   const
◆ Status()
 const ON_ComponentStatus ON_SubDFacePtr::Status  |  ( |   | ) |   const
Member Data Documentation
◆ m_ptr
 ON__UINT_PTR ON_SubDFacePtr::m_ptr
For performance reasons, m_ptr is not initialized and no constructors are declared or implemented. If you require initialization, then use x = ON_SubDFacePtr::Null or x = ON_SubDFacePtr::Create(...).
◆ Null
 const ON_SubDFacePtr ON_SubDFacePtr::Null
static