Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_2dVector Class Reference
OpenNURBS
#include <opennurbs_point.h>
 Public Member Functions
ON_2dVector ()=default
x,y not initialized More...
ON_2dVector (const double *)
from double[2] array More...
ON_2dVector (const float *)
from double[2] array More...
ON_2dVector (const ON_2dPoint &)
from 2d point More...
ON_2dVector (const ON_2dVector &)=default
ON_2dVector (const ON_2fPoint &)
from 2f point More...
ON_2dVector (const ON_2fVector &)
from 2f vector More...
ON_2dVector (const ON_3dPoint &)
from 3d point More...
ON_2dVector (const ON_3dVector &)
from 3d vector More...
ON_2dVector (const ON_3fPoint &)
from 3f point More...
ON_2dVector (const ON_3fVector &)
from 3f vector More...
ON_2dVector (double x, double y)
~ON_2dVector ()=default
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
bool  | Decompose (const ON_2dVector &, const ON_2dVector &, double *, double *) const
bool  | IsNan () const
bool  | IsNotZero () const
int  | IsParallelTo (const ON_2dVector &other, double angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE) const
bool  | IsPerpendicularTo (const ON_2dVector &other, double angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE) const
bool  | IsTiny (double tiny_tol=ON_ZERO_TOLERANCE) const
bool  | IsUnitVector () const
bool  | IsUnset () const
bool  | IsUnsetOrNan () const
bool  | IsValid () const
bool  | IsZero () const
double  | Length () const
double  | LengthSquared () const
double  | MaximumCoordinate () const
absolute value of maximum coordinate More...
int  | MaximumCoordinateIndex () const
double  | MinimumCoordinate () const
absolute value of minimum coordinate More...
int  | MinimumCoordinateIndex () const
operator const double * () const
operator double * ()
(double*) conversion operators More...
bool  | operator!= (const ON_2dVector &) const
double  | operator* (const ON_2dPoint &) const
inner (dot) product (point acting as vector) More...
double  | operator* (const ON_2dVector &) const
DO NOT ADD ANY MORE overrides of += or -=. More...
double  | operator* (const ON_2fVector &) const
inner (dot) product More...
ON_2dVector  | operator* (const ON_Xform &) const
ON_2dVector  | operator* (double) const
ON_2dVector  | operator* (float) const
ON_2dVector  | operator* (int) const
ON_2dVector &  | operator*= (double)
ON_2dPoint  | operator+ (const ON_2dPoint &) const
ON_2dVector  | operator+ (const ON_2dVector &) const
ON_2dPoint  | operator+ (const ON_2fPoint &) const
ON_2dVector  | operator+ (const ON_2fVector &) const
ON_3dPoint  | operator+ (const ON_3dPoint &) const
ON_3dVector  | operator+ (const ON_3dVector &) const
ON_3dPoint  | operator+ (const ON_3fPoint &) const
ON_3dVector  | operator+ (const ON_3fVector &) const
ON_2dVector &  | operator+= (const ON_2dVector &)
ON_2dVector  | operator- () const
ON_2dPoint  | operator- (const ON_2dPoint &) const
ON_2dVector  | operator- (const ON_2dVector &) const
ON_2dPoint  | operator- (const ON_2fPoint &) const
ON_2dVector  | operator- (const ON_2fVector &) const
ON_3dPoint  | operator- (const ON_3dPoint &) const
ON_3dVector  | operator- (const ON_3dVector &) const
ON_3dPoint  | operator- (const ON_3fPoint &) const
ON_3dVector  | operator- (const ON_3fVector &) const
ON_2dVector &  | operator-= (const ON_2dVector &)
ON_2dVector  | operator/ (double) const
ON_2dVector  | operator/ (float) const
ON_2dVector  | operator/ (int) const
ON_2dVector &  | operator/= (double)
bool  | operator< (const ON_2dVector &) const
bool  | operator<= (const ON_2dVector &) const
dictionary order comparisons More...
ON_2dVector &  | operator= (const double *)
vector = double[2] support More...
ON_2dVector &  | operator= (const float *)
vector = float[2] support More...
ON_2dVector &  | operator= (const ON_2dPoint &)
ON_2dVector &  | operator= (const ON_2dVector &)=default
ON_2dVector &  | operator= (const ON_2fPoint &)
ON_2dVector &  | operator= (const ON_2fVector &)
ON_2dVector &  | operator= (const ON_3dPoint &)
ON_2dVector &  | operator= (const ON_3dVector &)
use implicit operator=(const ON_2dVector&) More...
ON_2dVector &  | operator= (const ON_3fPoint &)
ON_2dVector &  | operator= (const ON_3fVector &)
bool  | operator== (const ON_2dVector &) const
bool  | operator> (const ON_2dVector &) const
bool  | operator>= (const ON_2dVector &) const
double &  | operator[] (int)
index operators mimic double[2] behavior More...
double  | operator[] (int) const
double &  | operator[] (unsigned int)
double  | operator[] (unsigned int) const
bool  | PerpendicularTo (const ON_2dPoint &, const ON_2dPoint &)
set this vector to be perpendicular to a line defined by 2 points More...
bool  | PerpendicularTo (const ON_2dVector &)
set this vector to be perpendicular to another vector More...
void  | Reverse ()
negate all coordinates More...
void  | Rotate (double angle)
void  | Rotate (double sin_angle, double cos_angle)
void  | Set (double x, double y)
set 2d vector value More...
void  | Transform (const ON_Xform &)
bool  | Unitize ()
returns false if vector has zero length More...
ON_2dVector  | UnitVector () const
double  | WedgeProduct (const ON_2dVector &B) const
void  | Zero ()
set all coordinates to zero; More...
 Static Public Member Functions
static int  | Compare (const ON_2dVector &lhs, const ON_2dVector &rhs)
static const ON_2dVector &  | UnitVector (int)
 Public Attributes
double  | x
double  | y
 Static Public Attributes
static const ON_2dVector  | NanVector
(ON_DBL_QNAN,ON_DBL_QNAN) More...
static const ON_2dVector  | UnsetVector
(ON_UNSET_VALUE,ON_UNSET_VALUE) More...
static const ON_2dVector  | XAxis
(1.0,0.0) More...
static const ON_2dVector  | YAxis
(0.0,1.0) More...
static const ON_2dVector  | ZeroVector
(0.0,0.0) More...
Detailed Description
ON_2dVector