Public Types | Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_SubDQuadFacePackSide Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Types
enum  | : unsigned { SeedCapacity = 8 }
 Public Member Functions
const ON_SubDEdge *  | Edge () const
unsigned  | EdgeDex () const
const ON_SubDEdgePtr  | EdgePtr () const
const ON_SubDFace *  | Face () const
bool  | IsNotNull () const
bool  | IsNull () const
bool  | IsPackable () const
bool  | Mark () const
const ON_SubDQuadFacePackSide  | NeigborFace (bool bStopAtCrease) const
const ON_SubDQuadFacePackSide  | NeigborFace (unsigned relative_side_dex, bool bStopAtCrease) const
unsigned  | PackId () const
const ON_SubDEdge *  | RelativeEdge (unsigned relative_side_dex) const
const ON_SubDEdgePtr  | RelativeEdgePtr (unsigned relative_side_dex) const
const ON_SubDQuadFacePackSide  | RelativeSide (unsigned relative_side_dex) const
void  | SetMark (bool bMark) const
void  | SetPackId (unsigned int pack_id)
 Static Public Member Functions
static bool  | CheckStrip (const ON_SimpleArray< ON_SubDQuadFacePackSide > &strip)
static bool  | CheckStrip (const ON_SubDQuadFacePackSide *strip, unsigned strip_count)
static const ON_SubDQuadFacePackSide  | Create (const ON_SubDFace *face, unsigned int edge_dex)
static bool  | GetPackSeed (const ON_SubDFace *face, unsigned count, ON_SubDQuadFacePackSide group[ON_SubDQuadFacePackSide::SeedCapacity][ON_SubDQuadFacePackSide::SeedCapacity])
static unsigned  | GetStrip (ON_SubDQuadFacePackSide f, ON_SimpleArray< ON_SubDQuadFacePackSide > &strip, unsigned strip_capacity)
static unsigned  | GetStrip (ON_SubDQuadFacePackSide f, ON_SubDQuadFacePackSide *strip, unsigned strip_capacity)
static bool  | IsPackableFace (const ON_SubDFace *face)
static void  | ReverseStrip (ON_SubDQuadFacePackSide *strip, unsigned strip_count)
static void  | SetStripMark (bool bMark, const ON_SubDQuadFacePackSide *strip, unsigned count)
static bool  | StripsAreNeighbors (const ON_SubDQuadFacePackSide *strip0, unsigned strip0_side_dex, const ON_SubDQuadFacePackSide *strip1, unsigned strip1_side_dex, unsigned count)
 Static Public Attributes
static const ON_SubDQuadFacePackSide  | Null
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum : unsigned
no construction for efficiency ON_SubDQuadFacePackSide() = default; ~ON_SubDQuadFacePackSide() = default; ON_SubDQuadFacePackSide(const ON_SubDQuadFacePackSide&) = default; ON_SubDQuadFacePackSide& operator=(const ON_SubDQuadFacePackSide&) = default;
Enumerator
SeedCapacity
Member Function Documentation
◆ CheckStrip() [1/2]
 static bool ON_SubDQuadFacePackSide::CheckStrip  |  ( |  const ON_SimpleArray< ON_SubDQuadFacePackSide > &  |  strip | )
static
◆ CheckStrip() [2/2]
 static bool ON_SubDQuadFacePackSide::CheckStrip  |  ( |  const ON_SubDQuadFacePackSide *  |  strip,
|  unsigned  |  strip_count
)
static
◆ Create()
 static const ON_SubDQuadFacePackSide ON_SubDQuadFacePackSide::Create  |  ( |  const ON_SubDFace *  |  face,
|  unsigned int  |  edge_dex
)
static
◆ Edge()
 const ON_SubDEdge* ON_SubDQuadFacePackSide::Edge  |  ( |   | ) |   const
◆ EdgeDex()
 unsigned ON_SubDQuadFacePackSide::EdgeDex  |  ( |   | ) |   const
◆ EdgePtr()
 const ON_SubDEdgePtr ON_SubDQuadFacePackSide::EdgePtr  |  ( |   | ) |   const
◆ Face()
 const ON_SubDFace* ON_SubDQuadFacePackSide::Face  |  ( |   | ) |   const
◆ GetPackSeed()
 static bool ON_SubDQuadFacePackSide::GetPackSeed  |  ( |  const ON_SubDFace *  |  face,
|  unsigned  |  count,
|  ON_SubDQuadFacePackSide  |  group[ON_SubDQuadFacePackSide::SeedCapacity][ON_SubDQuadFacePackSide::SeedCapacity]
)
static
◆ GetStrip() [1/2]
 static unsigned ON_SubDQuadFacePackSide::GetStrip  |  ( |  ON_SubDQuadFacePackSide  |  f,
|  ON_SimpleArray< ON_SubDQuadFacePackSide > &  |  strip,
|  unsigned  |  strip_capacity
)
static
◆ GetStrip() [2/2]
 static unsigned ON_SubDQuadFacePackSide::GetStrip  |  ( |  ON_SubDQuadFacePackSide  |  f,
|  ON_SubDQuadFacePackSide *  |  strip,
|  unsigned  |  strip_capacity
)
static
◆ IsNotNull()
 bool ON_SubDQuadFacePackSide::IsNotNull  |  ( |   | ) |   const
◆ IsNull()
 bool ON_SubDQuadFacePackSide::IsNull  |  ( |   | ) |   const
◆ IsPackable()
 bool ON_SubDQuadFacePackSide::IsPackable  |  ( |   | ) |   const
◆ IsPackableFace()
 static bool ON_SubDQuadFacePackSide::IsPackableFace  |  ( |  const ON_SubDFace *  |  face | )
static
◆ Mark()
 bool ON_SubDQuadFacePackSide::Mark  |  ( |   | ) |   const
◆ NeigborFace() [1/2]
 const ON_SubDQuadFacePackSide ON_SubDQuadFacePackSide::NeigborFace  |  ( |  bool  |  bStopAtCrease | ) |   const
◆ NeigborFace() [2/2]
 const ON_SubDQuadFacePackSide ON_SubDQuadFacePackSide::NeigborFace  |  ( |  unsigned  |  relative_side_dex,
|  bool  |  bStopAtCrease
) |   |  const
◆ PackId()
 unsigned ON_SubDQuadFacePackSide::PackId  |  ( |   | ) |   const
◆ RelativeEdge()
 const ON_SubDEdge* ON_SubDQuadFacePackSide::RelativeEdge  |  ( |  unsigned  |  relative_side_dex | ) |   const
◆ RelativeEdgePtr()
 const ON_SubDEdgePtr ON_SubDQuadFacePackSide::RelativeEdgePtr  |  ( |  unsigned  |  relative_side_dex | ) |   const
◆ RelativeSide()
 const ON_SubDQuadFacePackSide ON_SubDQuadFacePackSide::RelativeSide  |  ( |  unsigned  |  relative_side_dex | ) |   const
◆ ReverseStrip()
 static void ON_SubDQuadFacePackSide::ReverseStrip  |  ( |  ON_SubDQuadFacePackSide *  |  strip,
|  unsigned  |  strip_count
)
static
◆ SetMark()
 void ON_SubDQuadFacePackSide::SetMark  |  ( |  bool  |  bMark | ) |   const
◆ SetPackId()
 void ON_SubDQuadFacePackSide::SetPackId  |  ( |  unsigned int  |  pack_id | )
◆ SetStripMark()
 static void ON_SubDQuadFacePackSide::SetStripMark  |  ( |  bool  |  bMark,
|  const ON_SubDQuadFacePackSide *  |  strip,
|  unsigned  |  count
)
static
◆ StripsAreNeighbors()
 static bool ON_SubDQuadFacePackSide::StripsAreNeighbors  |  ( |  const ON_SubDQuadFacePackSide *  |  strip0,
|  unsigned  |  strip0_side_dex,
|  const ON_SubDQuadFacePackSide *  |  strip1,
|  unsigned  |  strip1_side_dex,
|  unsigned  |  count
)
static
Member Data Documentation
◆ Null
 const ON_SubDQuadFacePackSide ON_SubDQuadFacePackSide::Null
static