Public Member Functions | List of all members
ON_SubDVertexIterator Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
ON_SubDVertexIterator ()=default
ON_SubDVertexIterator (const class ON_SubD &subd)
ON_SubDVertexIterator (const class ON_SubD &subd, const class ON_SubDEdge &edge)
Construct and interator that iterates over the vertices of an edge. More...
ON_SubDVertexIterator (const class ON_SubD &subd, const class ON_SubDFace &face)
Construct and interator that iterates over the vertices of a face. More...
ON_SubDVertexIterator (const class ON_SubD &subd, const class ON_SubDVertex &vertex)
Construct and interator that iterates over a single vertex. More...
ON_SubDVertexIterator (const class ON_SubDRef &subd_ref)
ON_SubDVertexIterator (const class ON_SubDRef &subd_ref, const class ON_SubDEdge &edge)
Construct and interator that iterates over the vertices of an edge. More...
ON_SubDVertexIterator (const class ON_SubDRef &subd_ref, const class ON_SubDFace &face)
Construct and interator that iterates over the vertices of a face. More...
ON_SubDVertexIterator (const class ON_SubDRef &subd_ref, const class ON_SubDVertex &vertex)
Construct and interator that iterates over a single vertex. More...
ON_SubDVertexIterator (const ON_SubDVertexIterator &)=default
const class ON_SubDVertex *  | CurrentVertex () const
unsigned int  | CurrentVertexIndex () const
const class ON_SubDVertex *  | FirstVertex ()
const class ON_SubDVertex *  | LastVertex ()
const class ON_SubDVertex *  | NextVertex ()
const class ON_SubDVertex *  | operator++ ()
ON_SubDVertexIterator &  | operator= (const ON_SubDVertexIterator &)=default
const class ON_SubD &  | SubD () const
const class ON_SubDRef &  | SubDRef () const
unsigned int  | VertexCount () const
Detailed Description
ON_SubDVertexIterator
Constructor & Destructor Documentation
◆ ON_SubDVertexIterator() [1/10]
 ON_SubDVertexIterator::ON_SubDVertexIterator  |  ( |  const class ON_SubD &  |  subd | )
The best way to get an ON_SubDVertexIterator is so use the ON_SubD member function ON_SubDVertexIterator vit = subd.VertexIterator();
◆ ON_SubDVertexIterator() [2/10]
 ON_SubDVertexIterator::ON_SubDVertexIterator  |  ( |  const class ON_SubDRef &  |  subd_ref | )
The best way to get an ON_SubDVertexIterator is so use the ON_SubD member function ON_SubDVertexIterator vit = subd.VertexIterator();
◆ ON_SubDVertexIterator() [3/10]
 ON_SubDVertexIterator::ON_SubDVertexIterator  |  ( |  const class ON_SubD &  |  subd,
|  const class ON_SubDVertex &  |  vertex
)
Construct and interator that iterates over a single vertex.
◆ ON_SubDVertexIterator() [4/10]
 ON_SubDVertexIterator::ON_SubDVertexIterator  |  ( |  const class ON_SubDRef &  |  subd_ref,
|  const class ON_SubDVertex &  |  vertex
)
Construct and interator that iterates over a single vertex.
◆ ON_SubDVertexIterator() [5/10]
 ON_SubDVertexIterator::ON_SubDVertexIterator  |  ( |  const class ON_SubD &  |  subd,
|  const class ON_SubDEdge &  |  edge
)
Construct and interator that iterates over the vertices of an edge.
◆ ON_SubDVertexIterator() [6/10]
 ON_SubDVertexIterator::ON_SubDVertexIterator  |  ( |  const class ON_SubDRef &  |  subd_ref,
|  const class ON_SubDEdge &  |  edge
)
Construct and interator that iterates over the vertices of an edge.
◆ ON_SubDVertexIterator() [7/10]
 ON_SubDVertexIterator::ON_SubDVertexIterator  |  ( |  const class ON_SubD &  |  subd,
|  const class ON_SubDFace &  |  face
)
Construct and interator that iterates over the vertices of a face.
◆ ON_SubDVertexIterator() [8/10]
 ON_SubDVertexIterator::ON_SubDVertexIterator  |  ( |  const class ON_SubDRef &  |  subd_ref,
|  const class ON_SubDFace &  |  face
)
Construct and interator that iterates over the vertices of a face.
◆ ON_SubDVertexIterator() [9/10]
 ON_SubDVertexIterator::ON_SubDVertexIterator  |  ( |   | )
default
◆ ON_SubDVertexIterator() [10/10]
 ON_SubDVertexIterator::ON_SubDVertexIterator  |  ( |  const ON_SubDVertexIterator &  |   | )
default
Member Function Documentation
◆ CurrentVertex()
 const class ON_SubDVertex* ON_SubDVertexIterator::CurrentVertex  |  ( |   | ) |   const
inline
Returns: Current vertex;
◆ CurrentVertexIndex()
 unsigned int ON_SubDVertexIterator::CurrentVertexIndex  |  ( |   | ) |   const
inline
Return: Interator index of the current vertex.
◆ FirstVertex()
 const class ON_SubDVertex* ON_SubDVertexIterator::FirstVertex  |  ( |   | )
inline
Description: Set the iterator to the beginning of the vertex list. Returns: First vertex in the list.
◆ LastVertex()
 const class ON_SubDVertex* ON_SubDVertexIterator::LastVertex  |  ( |   | )
inline
Description: Set the iterator to the end of the vertex list. Returns: Last vertex in the list.
◆ NextVertex()
 const class ON_SubDVertex* ON_SubDVertexIterator::NextVertex  |  ( |   | )
inline
Description: Increment the iterator. Returns: Next vertex. Remarks: operator++ and NextVertex() behave differently.
◆ operator++()
 const class ON_SubDVertex* ON_SubDVertexIterator::operator++  |  ( |   | )
inline
Description: Increment the iterator. Returns: Current vertex. Remarks: operator++ and NextVertex() behave differently.
◆ operator=()
 ON_SubDVertexIterator& ON_SubDVertexIterator::operator=  |  ( |  const ON_SubDVertexIterator &  |   | )
default
◆ SubD()
 const class ON_SubD& ON_SubDVertexIterator::SubD  |  ( |   | ) |   const
inline
Returns: The subD object for this iterator.
◆ SubDRef()
 const class ON_SubDRef& ON_SubDVertexIterator::SubDRef  |  ( |   | ) |   const
inline
◆ VertexCount()
 unsigned int ON_SubDVertexIterator::VertexCount  |  ( |   | ) |   const
inline
Return: Number of vertices this iterator will iterate through.