Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_SubDMeshFragmentGrid Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
unsigned int  | DisplayDensity () const
bool  | GetGridParameters (unsigned int grid_point_index, double grid_parameters[2]) const
const ON_2udex  | Grid2dexFromPointIndex (unsigned int grid_point_index) const
unsigned int  | GridFaceCount () const
unsigned int  | GridId () const
unsigned int  | GridPointCount () const
unsigned int  | LevelOfDetail () const
unsigned int  | PointIndexFromGrid2dex (unsigned int i, unsigned int j) const
unsigned int  | SidePointCount () const
unsigned int  | SideSegmentCount () const
 Static Public Member Functions
static ON_SubDMeshFragmentGrid  | QuadGridFromDisplayDensity (unsigned int display_density, unsigned int level_of_detail)
static ON_SubDMeshFragmentGrid  | QuadGridFromSideSegmentCount (unsigned int side_segment_count, unsigned int level_of_detail)
 Public Attributes
const unsigned int *  | m_F
unsigned short  | m_F_count
= m_side_segment_count*m_side_segment_count More...
unsigned short  | m_F_level_of_detail
0 = highest, > 0 = reduced More...
unsigned short  | m_F_stride
const ON_SubDMeshFragmentGrid *  | m_next_level_of_detail
nullptr or the next level with fewer facets. More...
const ON_SubDMeshFragmentGrid *  | m_prev_level_of_detail
nullptr or the previous level with more facets. More...
unsigned char  | m_reserved1 = 0
const unsigned int *  | m_S
[4*m_side_segment_count + 1] indices that form the polyline boundary. More...
unsigned char  | m_side_segment_count
= 2^n for non-empty grids (0 <= n <= 8) More...
 Static Public Attributes
static const ON_SubDMeshFragmentGrid  | Empty
static const ON_SubDMeshFragmentGrid  | OneQuadGrid
Detailed Description
ON_SubDMeshFragment
Meshes of ON_SubD limit surface are calculated in fragments.
Member Function Documentation
◆ DisplayDensity()
 unsigned int ON_SubDMeshFragmentGrid::DisplayDensity  |  ( |   | ) |   const
Returns: A number between 0 and 8 or ON_UNSET_INT_INDEX. SideSegmentCount() = 2^DisplayDensity().
◆ GetGridParameters()
 bool ON_SubDMeshFragmentGrid::GetGridParameters  |  ( |  unsigned int  |  grid_point_index,
|  double  |  grid_parameters[2]
) |   |  const
Parameters: grid_point_index - [in] 0 <= grid_point_index < GridPointCount(). grid_parameters = [out] normalize parameters for that point. These could be used in the role of surface evaluation parameters for texture mapping applications. Returns: True if grid_point_index was valid and grid_parameters was returned.
◆ Grid2dexFromPointIndex()
 const ON_2udex ON_SubDMeshFragmentGrid::Grid2dexFromPointIndex  |  ( |  unsigned int  |  grid_point_index | ) |   const
Parameters: grid_point_index - [in] 0 <= grid_point_index < GridPointCount(). Returns: Grid (i,j) for that grid_point_index.
 0 <= i < SidePointCount() 0 <= j < SidePointCount()
◆ GridFaceCount()
 unsigned int ON_SubDMeshFragmentGrid::GridFaceCount  |  ( |   | ) |   const
◆ GridId()
 unsigned int ON_SubDMeshFragmentGrid::GridId  |  ( |   | ) |   const
Description: The GridId() is persistent and unique based on the contents of the grid. It is intended to be used in render applications that store copies of ON_SubDMeshFragmentGrid settings in things like vertex object buffers and want a reliable way to index into them. The Empty grid has id = 0; Returns: 0: when the grid is empty 32*n + 2*lod + t: t = 0 for quads and 1 for tris, (0 <= n <= 8) m_F_count = 2^(2n), (0 <= lod <= 8) m_F_level_of_detail = lod Remarks: m_F_count is always
◆ GridPointCount()
 unsigned int ON_SubDMeshFragmentGrid::GridPointCount  |  ( |   | ) |   const
Returns: Total number of points in the grid = SidePointCount()*SidePointCount().
◆ LevelOfDetail()
 unsigned int ON_SubDMeshFragmentGrid::LevelOfDetail  |  ( |   | ) |   const
◆ PointIndexFromGrid2dex()
 unsigned int ON_SubDMeshFragmentGrid::PointIndexFromGrid2dex  |  ( |  unsigned int  |  i,
|  unsigned int  |  j
) |   |  const
Parameters: i - [in] 0 <= i < SidePointCount() j - [in] 0 <= j < SidePointCount() Returns: 0 <= grid_point_index < GridPointCount().
◆ QuadGridFromDisplayDensity()
 static ON_SubDMeshFragmentGrid ON_SubDMeshFragmentGrid::QuadGridFromDisplayDensity  |  ( |  unsigned int  |  display_density,
|  unsigned int  |  level_of_detail
)
static
◆ QuadGridFromSideSegmentCount()
 static ON_SubDMeshFragmentGrid ON_SubDMeshFragmentGrid::QuadGridFromSideSegmentCount  |  ( |  unsigned int  |  side_segment_count,
|  unsigned int  |  level_of_detail
)
static
Description: Get mesh facet quads that index into a grid of points. Parameters: side_segment_count - [in] number quads in each row and column of the quad grid. side_segment_count >= 1 side_segment_count <= ON_SubDMesh::MaximumSideSegmentCount side_segment_count must be a power of 2
level_of_detail - [in] 0: quad count = maximum quad count = (side_count x side_count) 1: quad count = 1/4 maximum quad count 1: quad count = 1/16 maximum quad count ... If 4^level_of_detail > maximum quad count, then a single quad is returned.
◆ SidePointCount()
 unsigned int ON_SubDMeshFragmentGrid::SidePointCount  |  ( |   | ) |   const
Returns: SideSegmentCount() + 1;
◆ SideSegmentCount()
 unsigned int ON_SubDMeshFragmentGrid::SideSegmentCount  |  ( |   | ) |   const
Member Data Documentation
◆ Empty
 const ON_SubDMeshFragmentGrid ON_SubDMeshFragmentGrid::Empty
static
No construction for performance reasons. use = ON_SubDMeshFragmentGrid::Empty QuadGridFromSideSegmentCount(...) or QuadGridFromDisplayDensity(...) to initialize.
ON_SubDMeshFragmentGrid() = default; ~ON_SubDMeshFragmentGrid() = default; ON_SubDMeshFragmentGrid(const ON_SubDMeshFragmentGrid&) = default; ON_SubDMeshFragmentGrid& operator=(const ON_SubDMeshFragmentGrid&) = default;
◆ m_F
 const unsigned int* ON_SubDMeshFragmentGrid::m_F
◆ m_F_count
 unsigned short ON_SubDMeshFragmentGrid::m_F_count
= m_side_segment_count*m_side_segment_count
◆ m_F_level_of_detail
 unsigned short ON_SubDMeshFragmentGrid::m_F_level_of_detail
0 = highest, > 0 = reduced
◆ m_F_stride
 unsigned short ON_SubDMeshFragmentGrid::m_F_stride
◆ m_next_level_of_detail
 const ON_SubDMeshFragmentGrid* ON_SubDMeshFragmentGrid::m_next_level_of_detail
nullptr or the next level with fewer facets.
◆ m_prev_level_of_detail
 const ON_SubDMeshFragmentGrid* ON_SubDMeshFragmentGrid::m_prev_level_of_detail
nullptr or the previous level with more facets.
◆ m_reserved1
 unsigned char ON_SubDMeshFragmentGrid::m_reserved1 = 0
◆ m_S
 const unsigned int* ON_SubDMeshFragmentGrid::m_S
[4*m_side_segment_count + 1] indices that form the polyline boundary.
◆ m_side_segment_count
 unsigned char ON_SubDMeshFragmentGrid::m_side_segment_count
= 2^n for non-empty grids (0 <= n <= 8)
◆ OneQuadGrid
 const ON_SubDMeshFragmentGrid ON_SubDMeshFragmentGrid::OneQuadGrid
static