Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_SubDComponentPoint Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
ON_SubDComponentPoint ()=default
ON_SubDComponentPoint (const ON_SubDComponentPoint &)=default
~ON_SubDComponentPoint ()=default
ON_SubDComponentPoint &  | operator= (const ON_SubDComponentPoint &)=default
 Static Public Member Functions
static int  | CompareComponentAndDirection (const ON_SubDComponentPoint *a, const ON_SubDComponentPoint *b)
 Public Attributes
ON_SubDComponentPtr  | m_component_ptr = ON_SubDComponentPtr::Null
m_component_ptr will be face, edge or vertex More...
ON_PickPoint  | m_pick_point = ON_PickPoint::Unset
 Static Public Attributes
static const ON_SubDComponentPoint  | Unset
Detailed Description
ON_SubDComponentPoint
Used in selection tests to return a point and parameters on a component.
Constructor & Destructor Documentation
◆ ON_SubDComponentPoint() [1/2]
 ON_SubDComponentPoint::ON_SubDComponentPoint  |  ( |   | )
default
◆ ~ON_SubDComponentPoint()
 ON_SubDComponentPoint::~ON_SubDComponentPoint  |  ( |   | )
default
◆ ON_SubDComponentPoint() [2/2]
 ON_SubDComponentPoint::ON_SubDComponentPoint  |  ( |  const ON_SubDComponentPoint &  |   | )
default
Member Function Documentation
◆ CompareComponentAndDirection()
 static int ON_SubDComponentPoint::CompareComponentAndDirection  |  ( |  const ON_SubDComponentPoint *  |  a,
|  const ON_SubDComponentPoint *  |  b
)
static
Description: Dictionary compare of component type, component pointer, and component direction (partial). This function is useful for sorting arrays of ON_SubDComponentPoint values remove duplicates.
◆ operator=()
 ON_SubDComponentPoint& ON_SubDComponentPoint::operator=  |  ( |  const ON_SubDComponentPoint &  |   | )
default
Member Data Documentation
◆ m_component_ptr
 ON_SubDComponentPtr ON_SubDComponentPoint::m_component_ptr = ON_SubDComponentPtr::Null
m_component_ptr will be face, edge or vertex
◆ m_pick_point
 ON_PickPoint ON_SubDComponentPoint::m_pick_point = ON_PickPoint::Unset
subfragment corner. unsigned int m_face_corner_index = ON_UNSET_UINT_INDEX; Otherwise the point is on the control net at the specified level. unsigned int m_level_index = ON_UNSET_UINT_INDEX;
◆ Unset
 const ON_SubDComponentPoint ON_SubDComponentPoint::Unset
static