Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_PlaneEquation Class Reference
OpenNURBS
#include <opennurbs_point.h>
 Public Member Functions
ON_PlaneEquation ()
ON_PlaneEquation (double xx, double yy, double zz, double dd)
ON_3dPoint  | ClosestPointTo (ON_3dPoint point) const
bool  | Create (ON_3dPoint P, ON_3dVector N)
ON_3dVector  | Direction () const
double  | DirectionLength () const
void  | Dump (class ON_TextLog &) const
bool  | IsNearerThan (const class ON_BezierCurve &bezcrv, double s0, double s1, int sample_count, double endpoint_tolerance, double interior_tolerance, double *smin, double *smax) const
int  | IsParallelTo (const ON_PlaneEquation &other, double angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE) const
bool  | IsSet () const
bool  | IsValid () const
double  | MaximumAbsoluteValueAt (bool bRational, int point_count, int point_stride, const double *points, double stop_value) const
double  | MaximumCoefficient () const
double  | MaximumValueAt (bool bRational, int point_count, int point_stride, const double *points, double stop_value) const
double  | MaximumValueAt (const class ON_CurveLeafBox &crvleafbox) const
double  | MaximumValueAt (const class ON_SurfaceLeafBox &srfleafbox) const
double  | MaximumValueAt (const ON_BoundingBox &bbox) const
double  | MinimumValueAt (bool bRational, int point_count, int point_stride, const double *points, double stop_value) const
double  | MinimumValueAt (const class ON_CurveLeafBox &crvleafbox) const
double  | MinimumValueAt (const class ON_SurfaceLeafBox &srfleafbox) const
double  | MinimumValueAt (const ON_BoundingBox &bbox) const
ON_PlaneEquation  | NegatedPlaneEquation () const
bool  | operator!= (const ON_PlaneEquation &) const
bool  | operator== (const ON_PlaneEquation &) const
double &  | operator[] (int)
double  | operator[] (int) const
double &  | operator[] (unsigned int)
double  | operator[] (unsigned int) const
bool  | Transform (const ON_Xform &xform)
ON_PlaneEquation  | UnitizedPlaneEquation () const
ON_3dVector  | UnitNormal () const
double  | ValueAt (double x, double y, double z) const
double *  | ValueAt (int Pcount, const ON_3dPoint *P, double *value, double value_range[2]) const
double *  | ValueAt (int Pcount, const ON_3fPoint *P, double *value, double value_range[2]) const
double  | ValueAt (ON_3dPoint P) const
double  | ValueAt (ON_3dVector P) const
double  | ValueAt (ON_4dPoint P) const
ON_Interval  | ValueRange (const class ON_3dPointListRef &point_list) const
ON_Interval  | ValueRange (const ON_SimpleArray< ON_3dPoint > &point_list) const
ON_Interval  | ValueRange (const ON_SimpleArray< ON_3fPoint > &point_list) const
ON_Interval  | ValueRange (size_t point_index_count, const unsigned int *point_index_list, const class ON_3dPointListRef &point_list) const
ON_Interval  | ValueRange (size_t point_index_count, size_t point_index_stride, const unsigned int *point_index_list, const class ON_3dPointListRef &point_list) const
ON_Interval  | ValueRange (size_t point_list_count, const ON_3dPoint *point_list) const
ON_Interval  | ValueRange (size_t point_list_count, const ON_3fPoint *point_list) const
double  | ZeroTolerance () const
 Static Public Member Functions
static void  | Set (ON_PlaneEquation &plane_equation, double x, double y, double z, double d)
 Public Attributes
double  | d
4th coefficient of the plane equation. More...
double  | x
double  | y
double  | z
 Static Public Attributes
static const ON_PlaneEquation  | NanPlaneEquation
(ON_DBL_QNAN,ON_DBL_QNAN,ON_DBL_QNAN,ON_DBL_QNAN) More...
static const ON_PlaneEquation  | UnsetPlaneEquation
(ON_UNSET_VALUE,ON_UNSET_VALUE,ON_UNSET_VALUE,ON_UNSET_VALUE) More...
static const ON_PlaneEquation  | ZeroPlaneEquation
(0.0,0.0,0.0,0.0) More...
Detailed Description
Description: Typically the vector portion is a unit vector and m_d = -(x*P.x + y*P.y + z*P.z) for a point P on the plane.