Public Types | Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_Symmetry Class Reference
OpenNURBS
#include <opennurbs_symmetry.h>
 Public Types
enum  | : unsigned int { MaximumOrder = 4096 }
enum  | Coordinates : unsigned char { Coordinates::Unset = 0, Coordinates::Object = 1, Coordinates::World = 2 }
enum  | Type : unsigned char {
 Type::Unset = 0, Type::Reflect = 1, Type::Rotate = 2, Type::ReflectAndRotate = 3,
 Type::Inversion = 4, Type::Cyclic = 5
 }
 Public Member Functions
ON_Symmetry ()=default
ON_Symmetry (const ON_Symmetry &)=default
~ON_Symmetry ()=default
void  | Clear ()
void  | ClearSymmetricObjectContentSerialNumber () const
unsigned int  | CyclicOrder () const
const ON_Xform  | CyclicTransform () const
void  | Dump (class ON_TextLog &) const
const ON_SHA1_Hash  | Hash () const
unsigned int  | InversionOrder () const
const ON_Xform  | InversionTransform () const
bool  | IsSet () const
bool  | IsUnset () const
unsigned int  | MotifCount () const
const ON_Xform  | MotifTransformation (int index) const
ON_Symmetry &  | operator= (const ON_Symmetry &)=default
bool  | Read (class ON_BinaryArchive &)
const ON_PlaneEquation  | ReflectionPlane () const
double  | RotationAngleDegrees () const
double  | RotationAngleRadians () const
const ON_Line  | RotationAxis () const
const ON_3dVector  | RotationAxisDirection () const
const ON_3dPoint  | RotationAxisPoint () const
const ON_3dVector  | RotationAxisTangent () const
unsigned int  | RotationCount () const
void  | SetSymmetricObjectContentSerialNumber (ON__UINT64 symmetric_object_content_serial_number) const
ON_SHA1_Hash  | Sha1Hash () const
ON__UINT64  | SymmetricObjectContentSerialNumber () const
ON_Symmetry::Coordinates  | SymmetryCoordinates () const
const ON_UUID  | SymmetryId () const
ON_Symmetry::Type  | SymmetryType () const
const ON_Symmetry  | TransformConditionally (const ON_Xform &xform) const
const ON_Symmetry  | TransformUnconditionally (const ON_Xform &xform) const
bool  | Write (class ON_BinaryArchive &) const
 Static Public Member Functions
static int  | Compare (const ON_Symmetry *lhs, const ON_Symmetry *rhs)
static int  | CompareSymmetryTransformation (const ON_Symmetry *lhs, const ON_Symmetry *rhs, double zero_tolerance)
static const ON_Symmetry  | CreateCyclicSymmetry (ON_UUID symmetry_id, ON_Xform cyclic_transform, unsigned int cyclic_order, ON_Symmetry::Coordinates symmetry_coordinates)
static const ON_Symmetry  | CreateInversionSymmetry (ON_UUID symmetry_id, ON_Xform inversion_transform, ON_Symmetry::Coordinates symmetry_coordinates)
static const ON_Symmetry  | CreateReflectAndRotateSymmetry (ON_PlaneEquation reflection_plane, ON_Line rotation_axis, unsigned int rotation_count, ON_Symmetry::Coordinates symmetry_coordinates)
static const ON_Symmetry  | CreateReflectSymmetry (ON_PlaneEquation reflection_plane, ON_Symmetry::Coordinates symmetry_coordinates)
static const ON_Symmetry  | CreateRotateSymmetry (ON_Line rotation_axis, unsigned int rotation_count, ON_Symmetry::Coordinates symmetry_coordinates)
static ON_Symmetry::Coordinates  | SymmetryCoordinatesFromUnsigned (unsigned int coordinates_as_unsigned)
static const ON_wString  | SymmetryCoordinatesToString (ON_Symmetry::Coordinates symmetry_coordinates)
static ON_Symmetry::Type  | SymmetryTypeFromUnsigned (unsigned int symmetry_type_as_unsigned)
static const ON_wString  | SymmetryTypeToString (ON_Symmetry::Type symmetry_type)
 Static Public Attributes
static const ON_UUID  | ReflectAndRotateId
static const ON_UUID  | ReflectId
static const ON_UUID  | RotateId
static const ON_Symmetry  | Unset
Detailed Description
NoKeywords
/ / Copyright (c) 1993-2014 Robert McNeel & Associates. All rights reserved. / OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert / McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. / / For complete openNURBS copyright information see http://www.opennurbs.org. / ////////////////////////////////////////////////////////////// ON_Symmetry
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum : unsigned int
Enumerator
MaximumOrder
◆ Coordinates
 enum ON_Symmetry::Coordinates : unsigned char
strong
Enumerator
Unset
Object
The symmetry is associated with an object is is applied to. If that object is transformed, the symmetry's planes and rotation axes are also transformed.
World
The symmetry is indepenent of any objects is it applied to. The symmetry's planes and rotation axes are not changed when any of those objects are transformed.
◆ Type
 enum ON_Symmetry::Type : unsigned char
strong
Enumerator
Unset
Reflect
Reflection about a plane. The symmetric object has 2 copies of the motif. Points on the reflection plane are fixed.
Rotate
Rotation around an axis. The symmetric object has reflection copies of the motif. Points on the axis are fixed.
ReflectAndRotate
Reflection and rotation alternate. Rotation angle is 360/N degrees The symmetric object has 2N copies of the motif. Points on the rotation axis are fixed.
Inversion
General case inversion symmetry. (inversion transformation)^2 = identity. Det(inversion transformation) = -1. The symmetric object has 2 copies of the motif.
Cyclic
General case cyclic symmtry (order >= 2) (cyclic transformation)^N = identity. When N is 2 or odd, Det(cyclic transformation) = 1. When N is even and greater than 2, Det(cyclic transformation) = 1 or -1. The symmetric object has N copies of the motif.
Constructor & Destructor Documentation
◆ ON_Symmetry() [1/2]
 ON_Symmetry::ON_Symmetry  |  ( |   | )
default
◆ ~ON_Symmetry()
 ON_Symmetry::~ON_Symmetry  |  ( |   | )
default
◆ ON_Symmetry() [2/2]
 ON_Symmetry::ON_Symmetry  |  ( |  const ON_Symmetry &  |   | )
default
Member Function Documentation
◆ Clear()
 void ON_Symmetry::Clear  |  ( |   | )
Descripton: Set this instance to ON_Symmetry::Unset.
◆ ClearSymmetricObjectContentSerialNumber()
 void ON_Symmetry::ClearSymmetricObjectContentSerialNumber  |  ( |   | ) |   const
Description: Set the mutable value returned by SymmetricObjectContentSerialNumber() to 0.
◆ Compare()
 static int ON_Symmetry::Compare  |  ( |  const ON_Symmetry *  |  lhs,
|  const ON_Symmetry *  |  rhs
)
static
◆ CompareSymmetryTransformation()
 static int ON_Symmetry::CompareSymmetryTransformation  |  ( |  const ON_Symmetry *  |  lhs,
|  const ON_Symmetry *  |  rhs,
|  double  |  zero_tolerance
)
static
Returns: 0 if the symmetry transformations are the same to tolerance. Otherwise returns ON_Symmetry::Compare(lhs,rhs).
◆ CreateCyclicSymmetry()
 static const ON_Symmetry ON_Symmetry::CreateCyclicSymmetry  |  ( |  ON_UUID  |  symmetry_id,
|  ON_Xform  |  cyclic_transform,
|  unsigned int  |  cyclic_order,
|  ON_Symmetry::Coordinates  |  symmetry_coordinates
)
static
Description: Create a cyclic symmetry from a transformation. The symmetric object has order copies of the modif. Parameters: symmetry_id - [in] An id you can assign to the symmetry cyclic_transform - [in] cyclic_transform^order = identity cyclic_transform^i != identity when 0 < i < order If order is even and at least 4, then Det(cyclic_transform) = 1 or -1. Otherwise Det(cyclic_transform) = 1. cyclic_order - [in] cyclic_order >= 2 symmetry_coordinates - [in] object or world. Remarks: If cyclic_transform is a rotation, use CreateRotationSymmetry(). If cyclic_transform is a reflection, use CreateReflectionSymmetry(). If 2 = cyclic_order and Det(cyclic_transform) = -1, use CreateInversionSymmetry().
◆ CreateInversionSymmetry()
 static const ON_Symmetry ON_Symmetry::CreateInversionSymmetry  |  ( |  ON_UUID  |  symmetry_id,
|  ON_Xform  |  inversion_transform,
|  ON_Symmetry::Coordinates  |  symmetry_coordinates
)
static
Description: Create an inversion symmetry from a transformation. The symmetric object has 2 copies of the modif. Parameters: symmetry_id - [in] An id you can assign to the symmetry inversion_transform - [in] inversion_transform^2 = identity. Det(inversion_transform) = -1. symmetry_coordinates - [in] object or world. Remarks: If inversion_transform is a reflection, consider using CreateReflectSymmetry() instead. When Det(transformation) = 1 and transformtion^2 = identity, use CreateCyclicSymmetry() instead.
◆ CreateReflectAndRotateSymmetry()
 static const ON_Symmetry ON_Symmetry::CreateReflectAndRotateSymmetry  |  ( |  ON_PlaneEquation  |  reflection_plane,
|  ON_Line  |  rotation_axis,
|  unsigned int  |  rotation_count,
|  ON_Symmetry::Coordinates  |  symmetry_coordinates
)
static
Description: Reflection and rotation alternate. The symmetric object has 2*reflection copies of the motif. Points on the rotation axis are fixed.
 Parameters: reflection_plane - [in] rotation_axis - [in] A line in the reflection plane. rotation_count - [in] rotation_count must be >= 2 and the rotation angle is (360/rotation_count) degrees. symmetry_coordinates - [in] object or world. Example: If the reflection_plane is the y-z plane, the rotation axis is the z-axis, and rotation_count = 2, then (x,y,z) -> (-x,y,z) -> (-x-y,z) -> (x,-y,z) -> (x,y,z). Remarks: InversionTransform() = reflection. CyclicTransform() = rotation by (360/rotation_count) degrees.
◆ CreateReflectSymmetry()
 static const ON_Symmetry ON_Symmetry::CreateReflectSymmetry  |  ( |  ON_PlaneEquation  |  reflection_plane,
|  ON_Symmetry::Coordinates  |  symmetry_coordinates
)
static
Description: Reflection about a plane. The symmetric object has 2 copies of the motif. Points on the reflection plane are fixed. Parameters: reflection_plane - [in] symmetry_coordinates - [in] object or world. Example: If the reflection_plane is the y-z plane, then (x,y,z) -> (-x,y,z) -> (x,y,z). Remarks: InversionTransform() = reflection. CyclicTransform() = identity.
◆ CreateRotateSymmetry()
 static const ON_Symmetry ON_Symmetry::CreateRotateSymmetry  |  ( |  ON_Line  |  rotation_axis,
|  unsigned int  |  rotation_count,
|  ON_Symmetry::Coordinates  |  symmetry_coordinates
)
static
Description: Rotation around an axis. The symmetric object has reflection copies of the motif. Points on the axis are fixed.
 Parameters: rotation_axis - [in] rotation_count - [in] rotation_count must be >= 2 and the rotation angle is (360/rotation_count) degrees. symmetry_coordinates - [in] object or world. Example: If the rotation axis is the z-axis and the order is N, then then (x,y,z) -> (r*cos(a), r*sin(a), z) -> (r*cos(2*a), r*sin(2*a), z) -> ... -> (x,y,z), where r = sqrt(x*x + y*y) and a = (360 degrees)/N. Remarks: CyclicTransform() = rotation. InversionTransform() = identity.
◆ CyclicOrder()
 unsigned int ON_Symmetry::CyclicOrder  |  ( |   | ) |   const
Returns: 0: unset symmetry 1: the cyclic transformation is the identity. N >= 2: CyclicTransform()^N = idenity and CyclicTransform()^i != idenity when 0 < i < N. Remarks: In common cases, CyclicTransform() is either the identity or a rotation.
◆ CyclicTransform()
 const ON_Xform ON_Symmetry::CyclicTransform  |  ( |   | ) |   const
Returns: The cyclic transformation is returned. CyclicTransform()^CyclicOrder() = identity. Remarks: In common cases, CyclicTransform() is either the identity or a rotation. Remarks: NOTE: A symmetry with SymmetryOrder() = 2 and transformation S can be represented as either InversionTransform() = S and CyclicTransform() = identity or or CyclicTransform() = S and InversionTransform() = idenity. The convention is to use the cyclic transforms when S is a 180 rotations and inversion transforms otherwise.
◆ Dump()
 void ON_Symmetry::Dump  |  ( |  class ON_TextLog &  |   | ) |   const
◆ Hash()
 const ON_SHA1_Hash ON_Symmetry::Hash  |  ( |   | ) |   const
Returns: A SHA1 hash uniquely identifying the symmetry
◆ InversionOrder()
 unsigned int ON_Symmetry::InversionOrder  |  ( |   | ) |   const
Returns: 0: unset symmetry 1: InversionTransform() = identity 2: InversionTransform()^2 = identity and InversionTransform() != identity Remarks: In common cases, InversionTransform() is either the identity or a reflection.
◆ InversionTransform()
 const ON_Xform ON_Symmetry::InversionTransform  |  ( |   | ) |   const
Returns: The inversion transformation is returned. InversionTransform()^InversionOrder() = identity. Remarks: In common cases, InversionTransform() is either the identity or a reflection (mirror). Remarks: NOTE: A symmetry with SymmetryOrder() = 2 and transformation S can be represented as either InversionTransform() = S and CyclicTransform() = identity or or CyclicTransform() = S and InversionTransform() = idenity. The convention is to use the cyclic transforms when S is a 180 rotations and inversion transforms otherwise.
◆ IsSet()
 bool ON_Symmetry::IsSet  |  ( |   | ) |   const
Rturns: True if this instance is set to a symmetry.
◆ IsUnset()
 bool ON_Symmetry::IsUnset  |  ( |   | ) |   const
Rturns: True if this instance is not set.
◆ MotifCount()
 unsigned int ON_Symmetry::MotifCount  |  ( |   | ) |   const
Returns: Number of types the motif appears in the symmetric object. Remarks: MotifCount() = CyclicOrder()*InversionOrder().
◆ MotifTransformation()
 const ON_Xform ON_Symmetry::MotifTransformation  |  ( |  int  |  index | ) |   const
Description: Get the transformation that maps the starting motif to the specified copy. Parameters: index - [in] 0 based index of the copy (negative values are supported) Remarks: "0 based" means when index is a multiple of MotifCount(), the identity is returned.
◆ operator=()
 ON_Symmetry& ON_Symmetry::operator=  |  ( |  const ON_Symmetry &  |   | )
default
◆ Read()
 bool ON_Symmetry::Read  |  ( |  class ON_BinaryArchive &  |   | )
◆ ReflectionPlane()
 const ON_PlaneEquation ON_Symmetry::ReflectionPlane  |  ( |   | ) |   const
Returns: If the symmetry is type is Reflect or ReflectAndRotate, then the reflection plane is returned. Othewise ON_Plane::Nan is returned.
◆ RotationAngleDegrees()
 double ON_Symmetry::RotationAngleDegrees  |  ( |   | ) |   const
Returns: If the symmetry is type is Rotate or ReflectAndRotate, then the rotation angle in degrees is returned. Othewise ON_DBL_QNAN is returned. Remarks: RotationAngleDegrees() = 360.0/RotationCount()
◆ RotationAngleRadians()
 double ON_Symmetry::RotationAngleRadians  |  ( |   | ) |   const
Returns: If the symmetry is type is Rotate or ReflectAndRotate, then the rotation angle in radians is returned. Othewise ON_DBL_QNAN is returned. Remarks: RotationAngleRadians() = (2.0*ON_PI)/RotationCount()
◆ RotationAxis()
 const ON_Line ON_Symmetry::RotationAxis  |  ( |   | ) |   const
Returns: If the symmetry is type is Rotate or ReflectAndRotate, then the rotation axis is returned. Othewise ON_Line::Nan is returned.
◆ RotationAxisDirection()
 const ON_3dVector ON_Symmetry::RotationAxisDirection  |  ( |   | ) |   const
Returns: If the symmetry is type is Rotate or ReflectAndRotate, then the direction of the rotation axis is returned. Othewise ON_3dVector::Nan is returned. Remarks: This vector may have length != 1
◆ RotationAxisPoint()
 const ON_3dPoint ON_Symmetry::RotationAxisPoint  |  ( |   | ) |   const
Returns: If the symmetry is type is Rotate or ReflectAndRotate, then a point on the rotation axis is returned. Othewise ON_3dPoint::Nan is returned.
◆ RotationAxisTangent()
 const ON_3dVector ON_Symmetry::RotationAxisTangent  |  ( |   | ) |   const
Returns: If the symmetry is type is Rotate or ReflectAndRotate, then a unit vector in the direction of the rotation axis is returned. Othewise ON_3dVector::Nan is returned.
◆ RotationCount()
 unsigned int ON_Symmetry::RotationCount  |  ( |   | ) |   const
Returns: If the symmetry is type is Rotate or ReflectAndRotate, then the rotation count is returned. Othewise 0 is returned.
◆ SetSymmetricObjectContentSerialNumber()
 void ON_Symmetry::SetSymmetricObjectContentSerialNumber  |  ( |  ON__UINT64  |  symmetric_object_content_serial_number | ) |   const
Description: Set the mutable value returned by SymmetricObjectContentSerialNumber().
◆ Sha1Hash()
 ON_SHA1_Hash ON_Symmetry::Sha1Hash  |  ( |   | ) |   const
Returns: A SHA1 hash value that uniquely identifies the symmetry settings. Remarks: The symmetric object content serial number is not incuded in the hash.
◆ SymmetricObjectContentSerialNumber()
 ON__UINT64 ON_Symmetry::SymmetricObjectContentSerialNumber  |  ( |   | ) |   const
Returns: Set a runtime serial number that corresponded to the content of the symmetric object after it the application verified it was symmetric.
◆ SymmetryCoordinates()
 ON_Symmetry::Coordinates ON_Symmetry::SymmetryCoordinates  |  ( |   | ) |   const
Returns: Symmetry type.
◆ SymmetryCoordinatesFromUnsigned()
 static ON_Symmetry::Coordinates ON_Symmetry::SymmetryCoordinatesFromUnsigned  |  ( |  unsigned int  |  coordinates_as_unsigned | )
static
◆ SymmetryCoordinatesToString()
 static const ON_wString ON_Symmetry::SymmetryCoordinatesToString  |  ( |  ON_Symmetry::Coordinates  |  symmetry_coordinates | )
static
◆ SymmetryId()
 const ON_UUID ON_Symmetry::SymmetryId  |  ( |   | ) |   const
Returns: Symmetry unique id
◆ SymmetryType()
 ON_Symmetry::Type ON_Symmetry::SymmetryType  |  ( |   | ) |   const
Returns: Symmetry type.
◆ SymmetryTypeFromUnsigned()
 static ON_Symmetry::Type ON_Symmetry::SymmetryTypeFromUnsigned  |  ( |  unsigned int  |  symmetry_type_as_unsigned | )
static
◆ SymmetryTypeToString()
 static const ON_wString ON_Symmetry::SymmetryTypeToString  |  ( |  ON_Symmetry::Type  |  symmetry_type | )
static
◆ TransformConditionally()
 const ON_Symmetry ON_Symmetry::TransformConditionally  |  ( |  const ON_Xform &  |  xform | ) |   const
Description: If SymmetryCoordinates() = ON_Symmetry::Coordinates::Object, then the symmetry defition is transformed.
◆ TransformUnconditionally()
 const ON_Symmetry ON_Symmetry::TransformUnconditionally  |  ( |  const ON_Xform &  |  xform | ) |   const
Description: The the symmetry defition is transformed.
◆ Write()
 bool ON_Symmetry::Write  |  ( |  class ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ ReflectAndRotateId
 const ON_UUID ON_Symmetry::ReflectAndRotateId
static
◆ ReflectId
 const ON_UUID ON_Symmetry::ReflectId
static
◆ RotateId
 const ON_UUID ON_Symmetry::RotateId
static
◆ Unset
 const ON_Symmetry ON_Symmetry::Unset
static