Public Types | Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_SubDDisplayParameters Class Reference
OpenNURBS
#include <opennurbs_mesh.h>
 Public Types
enum  | : unsigned int {
 ExtraCoarseDensity = 1, MinimumDensity = 1, CoarseDensity = 2, MediumDensity = 3,
 FineDensity = 4, DefaultDensity = 4, ExtraFineDensity = 5, MaximumDensity = 6
 }
enum  | Context : unsigned char { Context::Unknown = 0, Context::SubDToMesh = 1, Context::SubDToNURBS = 2 }
 Public Member Functions
ON_SubDDisplayParameters ()=default
ON_SubDDisplayParameters (const ON_SubDDisplayParameters &)=default
~ON_SubDDisplayParameters ()=default
ON_SubDDisplayParameters::Context  | ContextForExperts () const
unsigned int  | DisplayDensity () const
void  | Dump (class ON_TextLog &) const
unsigned char  | EncodeAsUnsignedChar () const
ON_SubDComponentLocation  | MeshLocation () const
ON_SubDDisplayParameters &  | operator= (const ON_SubDDisplayParameters &)=default
ON_ProgressReporter *  | ProgressReporter () const
const ON_Interval  | ProgressReporterInterval () const
bool  | Read (class ON_BinaryArchive &archive)
void  | SetContextForExperts (ON_SubDDisplayParameters::Context context)
void  | SetDisplayDensity (unsigned int display_density)
void  | SetMeshLocation (ON_SubDComponentLocation mesh_location)
void  | SetProgressReporter (ON_ProgressReporter *progress_reporter, ON_Interval progress_reporter_interval)
void  | SetTerminator (ON_Terminator *terminator)
ON_Terminator *  | Terminator () const
TODO - split this class into two - what's above and one derived from that with what's below. More...
bool  | Write (class ON_BinaryArchive &archive) const
 Static Public Member Functions
static const ON_SubDDisplayParameters  | CreateFromDisplayDensity (unsigned int subd_display_density)
static const ON_SubDDisplayParameters  | CreateFromMeshDensity (double normalized_mesh_density)
static const ON_SubDDisplayParameters  | DecodeFromUnsignedChar (unsigned char encoded_parameters)
 Static Public Attributes
static const ON_SubDDisplayParameters  | Coarse
static const ON_SubDDisplayParameters  | Default
static const ON_SubDDisplayParameters  | Empty
static const ON_SubDDisplayParameters  | ExtraCoarse
static const ON_SubDDisplayParameters  | ExtraFine
static const ON_SubDDisplayParameters  | Fine
static const ON_SubDDisplayParameters  | Medium
Detailed Description
ON_SubDDisplayParameters
A collection of parameters that are passed to functions that calculate a various representations of ON_SubD objects.
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum : unsigned int
Enumerator
ExtraCoarseDensity
summary> Each SubD quad will generate 4 mesh quads in a 2x2 grid. A simple meshing density of 0% corresponds to ExtraCoarseDensity. Use ON_SubDDisplayParameters::CreateFromMeshDensity() to convert normalized meshing density settings to ON_SubDDisplayParameters density enum values. /summary>
MinimumDensity
summary> Each SubD quad will generate 16 mesh quads in a 4x4 grid. A simple meshing density of 1% to 19% corresponds to CoarseDensity. Use ON_SubDDisplayParameters::CreateFromMeshDensity() to convert normalized meshing density settings to ON_SubDDisplayParameters density enum values. /summary>
CoarseDensity
summary> Each SubD quad will generate 64 mesh quads in an 8x8 grid. A simple meshing density of 20% to 34% corresponds to MediumDensity. Use ON_SubDDisplayParameters::CreateFromMeshDensity() to convert normalized meshing density settings to ON_SubDDisplayParameters density enum values. This density is too low to produce acceptable results on the SubD Rhino Logo and many other models. /summary>
MediumDensity
summary> Each SubD quad will generate 256 mesh quads in a 16x16 grid. A simple meshing density of 35% to 75% corresponds to FineDensity. Use ON_SubDDisplayParameters::CreateFromMeshDensity() to convert normalized meshing density settings to ON_SubDDisplayParameters density enum values. This is the default value for creating mesh approximations of SubD surface.
 It produces acceptable results on the SubD Rhino Logo and most other models. /summary>
FineDensity
DefaultDensity
summary> Each SubD quad will generate 1024 mesh quads in a 32x32 grid. A simple meshing density of 76% to 99% corresponds to ExtraFineDensity. Use ON_SubDDisplayParameters::CreateFromMeshDensity() to convert normalized meshing density settings to ON_SubDDisplayParameters density enum values. /summary>
ExtraFineDensity
summary> Each SubD quad will generate 4096 mesh quads in a 64x64 grid. A simple meshing density of 100% corresponds to MaximumDensity. SubD display density values may never exceed 6 and core code assumes these values are &lt= 6. Use ON_SubDDisplayParameters::CreateFromMeshDensity() to convert normalized meshing density settings to ON_SubDDisplayParameters density enum values. This value creates ridiculously dense meshes and should generally be avoided. /summary>
MaximumDensity
◆ Context
 enum ON_SubDDisplayParameters::Context : unsigned char
strong
Enumerator
Unknown
summary> Unknown, unspecified, or unset context. This is typical. /summary> summary> These parameters are being used to generate a quad mesh approximations of an ON_SubD. Low level meshing code copies input paramters and specifies this context when appropriate. /summary>
SubDToMesh
summary> These parameters are being used to generate NURBS surface approximations of an ON_SubD. Low level conversion to NURB code copies input paramters and specifies this context when appropriate. /summary>
SubDToNURBS
Constructor & Destructor Documentation
◆ ON_SubDDisplayParameters() [1/2]
 ON_SubDDisplayParameters::ON_SubDDisplayParameters  |  ( |   | )
default
◆ ~ON_SubDDisplayParameters()
 ON_SubDDisplayParameters::~ON_SubDDisplayParameters  |  ( |   | )
default
◆ ON_SubDDisplayParameters() [2/2]
 ON_SubDDisplayParameters::ON_SubDDisplayParameters  |  ( |  const ON_SubDDisplayParameters &  |   | )
default
Member Function Documentation
◆ ContextForExperts()
 ON_SubDDisplayParameters::Context ON_SubDDisplayParameters::ContextForExperts  |  ( |   | ) |   const
Description: Low level mesh creation and ON_SubD to NURBS conversion code occasional looks at the context. Typically it is set in a local copy and no user of the top level ON_SubD SDK needs to be concerned about the context setting. This setting is not saved in 3dm archives and is ingnored by all compare functions.
◆ CreateFromDisplayDensity()
 static const ON_SubDDisplayParameters ON_SubDDisplayParameters::CreateFromDisplayDensity  |  ( |  unsigned int  |  subd_display_density | )
static
Description: In most applications, the caller sets the mesh_density and leaves the other parameters set to the default values. Parameters: subd_display_density - [in] A value between ON_SubDDisplayParameters::MinimumDensity and ON_SubDDisplayParameters::MaximumDensity.
◆ CreateFromMeshDensity()
 static const ON_SubDDisplayParameters ON_SubDDisplayParameters::CreateFromMeshDensity  |  ( |  double  |  normalized_mesh_density | )
static
Description: This function creates ON_SubDDisplayParameters from a user interface "slider" like Rhino's simple mesh controls. Parameters: normalized_mesh_density - [in] A double between 0.0 and 1.0
The table below shows the correpondence between normalized_density and subd display density.
Mesh density percentage / normalized_mesh_density / subd display density 0% -> [0.0, ON_ZERO_TOLERANCE] -> 1 = MinimumDensity 0% to 19% -> (ON_ZERO_TOLERANCE, 0.20) -> 2 = CoarseDensity 20% to 34% -> [0.20, 0.35) -> 3 = MediumDensity 35% to 75% -> [0.35, 0.75] -> 4 = FineDensity 76% to 99% -> (0.75, 1 - ON_ZERO_TOLERANCE) -> 5 = ExtraFineDensity 100% -> [1 - ON_ZERO_TOLERANCE, 1.0] -> 6 = MaximumDensity
Invalid input -> ON_SubDDisplayParameters::DefaultDensity;
Returns: A valid ON_SubDDisplayParameters with the specified subd display denstity.
◆ DecodeFromUnsignedChar()
 static const ON_SubDDisplayParameters ON_SubDDisplayParameters::DecodeFromUnsignedChar  |  ( |  unsigned char  |  encoded_parameters | )
static
◆ DisplayDensity()
 unsigned int ON_SubDDisplayParameters::DisplayDensity  |  ( |   | ) |   const
0 <= m_display_density <= ON_SubDDisplayParameters::MaximumDensity If n = m_display_density, then each SubD quad face will have a grid of 2^n x 2^n mesh quads for a total of 2^(2n) mesh quads. n grid size total number of mesh quad faces per SubD quad face 0 1 x 1 1 (avoid 0 - it does not work for n-gons n != 4) 1 2 x 2 4 2 4 x 4 16 3 8 x 8 64 4 16 x 16 128 5 32 x 32 1,024 6 64 x 64 4,096
◆ Dump()
 void ON_SubDDisplayParameters::Dump  |  ( |  class ON_TextLog &  |   | ) |   const
◆ EncodeAsUnsignedChar()
 unsigned char ON_SubDDisplayParameters::EncodeAsUnsignedChar  |  ( |   | ) |   const
◆ MeshLocation()
 ON_SubDComponentLocation ON_SubDDisplayParameters::MeshLocation  |  ( |   | ) |   const
Description: The MeshLocation() property determines if the mesh is on the SubD's control net or the SubD's surface.
◆ operator=()
 ON_SubDDisplayParameters& ON_SubDDisplayParameters::operator=  |  ( |  const ON_SubDDisplayParameters &  |   | )
default
◆ ProgressReporter()
 ON_ProgressReporter* ON_SubDDisplayParameters::ProgressReporter  |  ( |   | ) |   const
◆ ProgressReporterInterval()
 const ON_Interval ON_SubDDisplayParameters::ProgressReporterInterval  |  ( |   | ) |   const
◆ Read()
 bool ON_SubDDisplayParameters::Read  |  ( |  class ON_BinaryArchive &  |  archive | )
◆ SetContextForExperts()
 void ON_SubDDisplayParameters::SetContextForExperts  |  ( |  ON_SubDDisplayParameters::Context  |  context | )
◆ SetDisplayDensity()
 void ON_SubDDisplayParameters::SetDisplayDensity  |  ( |  unsigned int  |  display_density | )
◆ SetMeshLocation()
 void ON_SubDDisplayParameters::SetMeshLocation  |  ( |  ON_SubDComponentLocation  |  mesh_location | )
Description: The MeshLocation() property determines if the mesh is on the SubD's control net or the SubD's surface. Parameters: mesh_location - [in]
◆ SetProgressReporter()
 void ON_SubDDisplayParameters::SetProgressReporter  |  ( |  ON_ProgressReporter *  |  progress_reporter,
|  ON_Interval  |  progress_reporter_interval
)
◆ SetTerminator()
 void ON_SubDDisplayParameters::SetTerminator  |  ( |  ON_Terminator *  |  terminator | )
◆ Terminator()
 ON_Terminator* ON_SubDDisplayParameters::Terminator  |  ( |   | ) |   const
TODO - split this class into two - what's above and one derived from that with what's below.
◆ Write()
 bool ON_SubDDisplayParameters::Write  |  ( |  class ON_BinaryArchive &  |  archive | ) |   const
Member Data Documentation
◆ Coarse
 const ON_SubDDisplayParameters ON_SubDDisplayParameters::Coarse
static
Parameters for a course limit surface display mesh. m_display_density = ON_SubDDisplayParameters::CoarseDensity
◆ Default
 const ON_SubDDisplayParameters ON_SubDDisplayParameters::Default
static
Parameters for the default limit surface display mesh. m_display_density = ON_SubDDisplayParameters::DefaultDensity
◆ Empty
 const ON_SubDDisplayParameters ON_SubDDisplayParameters::Empty
static
◆ ExtraCoarse
 const ON_SubDDisplayParameters ON_SubDDisplayParameters::ExtraCoarse
static
Parameters for a course limit surface display mesh. m_display_density = ON_SubDDisplayParameters::ExtraCoarseDensity
◆ ExtraFine
 const ON_SubDDisplayParameters ON_SubDDisplayParameters::ExtraFine
static
Parameters for an extra fine limit surface display mesh. m_display_density = ON_SubDDisplayParameters::ExtraFineDensity
◆ Fine
 const ON_SubDDisplayParameters ON_SubDDisplayParameters::Fine
static
Parameters for the default limit surface display mesh. Produces and acceptable rendering of the SubD Rhino logo. m_display_density = ON_SubDDisplayParameters::FineDensity (default)
◆ Medium
 const ON_SubDDisplayParameters ON_SubDDisplayParameters::Medium
static
Parameters for a medium limit surface display mesh. To crude for a quality rendering of the SubD Rhino logo. m_display_density = ON_SubDDisplayParameters::MediumDensity