Public Member Functions | Public Attributes | List of all members
CRhRdkRenderingInfo Class Referencefinal
RDK
#include <RhRdkUiSdk.h>
 Public Member Functions
CRhRdkRenderingInfo ()
CRhRdkRenderingInfo (const CRhRdkRenderingInfo &)
~CRhRdkRenderingInfo ()
class CRhRdkRenderingInfoExtension &  | GetExtension (void) const
void  | operator= (const CRhRdkRenderingInfo &)
bool  | ReadFromFile (const wchar_t *wszFilename)
 Public Attributes
int  | m_iElapsedSeconds
ON_wString  | m_sFilename
ON_wString  | m_sRenderer
UINT_PTR  | m_uReserved
UUID  | m_uuidRenderer
Constructor & Destructor Documentation
◆ CRhRdkRenderingInfo() [1/2]
 CRhRdkRenderingInfo::CRhRdkRenderingInfo  |  ( |   | )
◆ CRhRdkRenderingInfo() [2/2]
 CRhRdkRenderingInfo::CRhRdkRenderingInfo  |  ( |  const CRhRdkRenderingInfo &  |   | )
◆ ~CRhRdkRenderingInfo()
 CRhRdkRenderingInfo::~CRhRdkRenderingInfo  |  ( |   | )
Member Function Documentation
◆ GetExtension()
 class CRhRdkRenderingInfoExtension& CRhRdkRenderingInfo::GetExtension  |  ( |  void  |   | ) |   const
◆ operator=()
 void CRhRdkRenderingInfo::operator=  |  ( |  const CRhRdkRenderingInfo &  |   | )
◆ ReadFromFile()
 bool CRhRdkRenderingInfo::ReadFromFile  |  ( |  const wchar_t *  |  wszFilename | )
Member Data Documentation
◆ m_iElapsedSeconds
 int CRhRdkRenderingInfo::m_iElapsedSeconds
◆ m_sFilename
 ON_wString CRhRdkRenderingInfo::m_sFilename
◆ m_sRenderer
 ON_wString CRhRdkRenderingInfo::m_sRenderer
◆ m_uReserved
 UINT_PTR CRhRdkRenderingInfo::m_uReserved
◆ m_uuidRenderer
 UUID CRhRdkRenderingInfo::m_uuidRenderer