Public Member Functions | List of all members
ON_PhysicallyBasedMaterial::ParametersNames Class Reference
#include <opennurbs_material.h>
 Public Member Functions
ON_DEPRECATED_MSG ("Use CRhRdkMaterial::PhysicallyBased::ParameterNames") static ON_wString Anisotropic(void)
ON_DEPRECATED_MSG ("Use CRhRdkMaterial::PhysicallyBased::ParameterNames") static ON_wString AnisotropicRotation(void)
ON_DEPRECATED_MSG ("Use CRhRdkMaterial::PhysicallyBased::ParameterNames") static ON_wString BaseColor(void)
ON_DEPRECATED_MSG ("Use CRhRdkMaterial::PhysicallyBased::ParameterNames") static ON_wString BRDF(void)
ON_DEPRECATED_MSG ("Use CRhRdkMaterial::PhysicallyBased::ParameterNames") static ON_wString Clearcoat(void)
ON_DEPRECATED_MSG ("Use CRhRdkMaterial::PhysicallyBased::ParameterNames") static ON_wString ClearcoatBump(void)
ON_DEPRECATED_MSG ("Use CRhRdkMaterial::PhysicallyBased::ParameterNames") static ON_wString ClearcoatRoughness(void)
ON_DEPRECATED_MSG ("Use CRhRdkMaterial::PhysicallyBased::ParameterNames") static ON_wString Emission(void)
ON_DEPRECATED_MSG ("Use CRhRdkMaterial::PhysicallyBased::ParameterNames") static ON_wString Metallic(void)
ON_DEPRECATED_MSG ("Use CRhRdkMaterial::PhysicallyBased::ParameterNames") static ON_wString Opacity(void)
ON_DEPRECATED_MSG ("Use CRhRdkMaterial::PhysicallyBased::ParameterNames") static ON_wString OpacityIor(void)
ON_DEPRECATED_MSG ("Use CRhRdkMaterial::PhysicallyBased::ParameterNames") static ON_wString OpacityRoughness(void)
ON_DEPRECATED_MSG ("Use CRhRdkMaterial::PhysicallyBased::ParameterNames") static ON_wString Roughness(void)
ON_DEPRECATED_MSG ("Use CRhRdkMaterial::PhysicallyBased::ParameterNames") static ON_wString Sheen(void)
ON_DEPRECATED_MSG ("Use CRhRdkMaterial::PhysicallyBased::ParameterNames") static ON_wString SheenTint(void)
ON_DEPRECATED_MSG ("Use CRhRdkMaterial::PhysicallyBased::ParameterNames") static ON_wString Specular(void)
ON_DEPRECATED_MSG ("Use CRhRdkMaterial::PhysicallyBased::ParameterNames") static ON_wString SpecularTint(void)
ON_DEPRECATED_MSG ("Use CRhRdkMaterial::PhysicallyBased::ParameterNames") static ON_wString Subsurface(void)
ON_DEPRECATED_MSG ("Use CRhRdkMaterial::PhysicallyBased::ParameterNames") static ON_wString SubsurfaceScatteringColor(void)
ON_DEPRECATED_MSG ("Use CRhRdkMaterial::PhysicallyBased::ParameterNames") static ON_wString SubsurfaceScatteringRadius(void)
Member Function Documentation
◆ ON_DEPRECATED_MSG() [1/20]
 ON_PhysicallyBasedMaterial::ParametersNames::ON_DEPRECATED_MSG  |  ( |  "Use CRhRdkMaterial::PhysicallyBased::ParameterNames"  |   | )
◆ ON_DEPRECATED_MSG() [2/20]
 ON_PhysicallyBasedMaterial::ParametersNames::ON_DEPRECATED_MSG  |  ( |  "Use CRhRdkMaterial::PhysicallyBased::ParameterNames"  |   | )
◆ ON_DEPRECATED_MSG() [3/20]
 ON_PhysicallyBasedMaterial::ParametersNames::ON_DEPRECATED_MSG  |  ( |  "Use CRhRdkMaterial::PhysicallyBased::ParameterNames"  |   | )
◆ ON_DEPRECATED_MSG() [4/20]
 ON_PhysicallyBasedMaterial::ParametersNames::ON_DEPRECATED_MSG  |  ( |  "Use CRhRdkMaterial::PhysicallyBased::ParameterNames"  |   | )
◆ ON_DEPRECATED_MSG() [5/20]
 ON_PhysicallyBasedMaterial::ParametersNames::ON_DEPRECATED_MSG  |  ( |  "Use CRhRdkMaterial::PhysicallyBased::ParameterNames"  |   | )
◆ ON_DEPRECATED_MSG() [6/20]
 ON_PhysicallyBasedMaterial::ParametersNames::ON_DEPRECATED_MSG  |  ( |  "Use CRhRdkMaterial::PhysicallyBased::ParameterNames"  |   | )
◆ ON_DEPRECATED_MSG() [7/20]
 ON_PhysicallyBasedMaterial::ParametersNames::ON_DEPRECATED_MSG  |  ( |  "Use CRhRdkMaterial::PhysicallyBased::ParameterNames"  |   | )
◆ ON_DEPRECATED_MSG() [8/20]
 ON_PhysicallyBasedMaterial::ParametersNames::ON_DEPRECATED_MSG  |  ( |  "Use CRhRdkMaterial::PhysicallyBased::ParameterNames"  |   | )
◆ ON_DEPRECATED_MSG() [9/20]
 ON_PhysicallyBasedMaterial::ParametersNames::ON_DEPRECATED_MSG  |  ( |  "Use CRhRdkMaterial::PhysicallyBased::ParameterNames"  |   | )
◆ ON_DEPRECATED_MSG() [10/20]
 ON_PhysicallyBasedMaterial::ParametersNames::ON_DEPRECATED_MSG  |  ( |  "Use CRhRdkMaterial::PhysicallyBased::ParameterNames"  |   | )
◆ ON_DEPRECATED_MSG() [11/20]
 ON_PhysicallyBasedMaterial::ParametersNames::ON_DEPRECATED_MSG  |  ( |  "Use CRhRdkMaterial::PhysicallyBased::ParameterNames"  |   | )
◆ ON_DEPRECATED_MSG() [12/20]
 ON_PhysicallyBasedMaterial::ParametersNames::ON_DEPRECATED_MSG  |  ( |  "Use CRhRdkMaterial::PhysicallyBased::ParameterNames"  |   | )
◆ ON_DEPRECATED_MSG() [13/20]
 ON_PhysicallyBasedMaterial::ParametersNames::ON_DEPRECATED_MSG  |  ( |  "Use CRhRdkMaterial::PhysicallyBased::ParameterNames"  |   | )
◆ ON_DEPRECATED_MSG() [14/20]
 ON_PhysicallyBasedMaterial::ParametersNames::ON_DEPRECATED_MSG  |  ( |  "Use CRhRdkMaterial::PhysicallyBased::ParameterNames"  |   | )
◆ ON_DEPRECATED_MSG() [15/20]
 ON_PhysicallyBasedMaterial::ParametersNames::ON_DEPRECATED_MSG  |  ( |  "Use CRhRdkMaterial::PhysicallyBased::ParameterNames"  |   | )
◆ ON_DEPRECATED_MSG() [16/20]
 ON_PhysicallyBasedMaterial::ParametersNames::ON_DEPRECATED_MSG  |  ( |  "Use CRhRdkMaterial::PhysicallyBased::ParameterNames"  |   | )
◆ ON_DEPRECATED_MSG() [17/20]
 ON_PhysicallyBasedMaterial::ParametersNames::ON_DEPRECATED_MSG  |  ( |  "Use CRhRdkMaterial::PhysicallyBased::ParameterNames"  |   | )
◆ ON_DEPRECATED_MSG() [18/20]
 ON_PhysicallyBasedMaterial::ParametersNames::ON_DEPRECATED_MSG  |  ( |  "Use CRhRdkMaterial::PhysicallyBased::ParameterNames"  |   | )
◆ ON_DEPRECATED_MSG() [19/20]
 ON_PhysicallyBasedMaterial::ParametersNames::ON_DEPRECATED_MSG  |  ( |  "Use CRhRdkMaterial::PhysicallyBased::ParameterNames"  |   | )
◆ ON_DEPRECATED_MSG() [20/20]
 ON_PhysicallyBasedMaterial::ParametersNames::ON_DEPRECATED_MSG  |  ( |  "Use CRhRdkMaterial::PhysicallyBased::ParameterNames"  |   | )