Public Member Functions | List of all members
ON_SubDEdgeIterator Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
ON_SubDEdgeIterator ()=default
ON_SubDEdgeIterator (const class ON_SubD &subd)
ON_SubDEdgeIterator (const class ON_SubD &subd, const class ON_SubDEdge &edge)
Construct and interator that iterates over a single edge. More...
ON_SubDEdgeIterator (const class ON_SubD &subd, const class ON_SubDFace &face)
Construct and interator that iterates over the edges of a face. More...
ON_SubDEdgeIterator (const class ON_SubD &subd, const class ON_SubDVertex &vertex)
Construct and interator that iterates over the edges of a vertex. More...
ON_SubDEdgeIterator (const class ON_SubDRef &subd_ref)
ON_SubDEdgeIterator (const class ON_SubDRef &subd_ref, const class ON_SubDEdge &edge)
Construct and interator that iterates over a single edge. More...
ON_SubDEdgeIterator (const class ON_SubDRef &subd_ref, const class ON_SubDFace &face)
Construct and interator that iterates over the edges of a face. More...
ON_SubDEdgeIterator (const class ON_SubDRef &subd_ref, const class ON_SubDVertex &vertex)
Construct and interator that iterates over the edges of a vertex. More...
ON_SubDEdgeIterator (const ON_SubDEdgeIterator &)=default
const class ON_SubDEdge *  | CurrentEdge () const
unsigned int  | CurrentEdgeIndex () const
unsigned int  | EdgeCount () const
const class ON_SubDEdge *  | FirstEdge ()
const class ON_SubDEdge *  | LastEdge ()
const class ON_SubDEdge *  | NextEdge ()
const class ON_SubDEdge *  | operator++ ()
ON_SubDEdgeIterator &  | operator= (const ON_SubDEdgeIterator &)=default
const class ON_SubD &  | SubD () const
const class ON_SubDRef &  | SubDRef () const
Detailed Description
ON_SubDEdgeIterator
Constructor & Destructor Documentation
◆ ON_SubDEdgeIterator() [1/10]
 ON_SubDEdgeIterator::ON_SubDEdgeIterator  |  ( |  const class ON_SubD &  |  subd | )
The best way to get an ON_SubDEdgeIterator is so use the ON_SubD member function ON_SubDEdgeIterator eit = subd.EdgeIterator();
◆ ON_SubDEdgeIterator() [2/10]
 ON_SubDEdgeIterator::ON_SubDEdgeIterator  |  ( |  const class ON_SubDRef &  |  subd_ref | )
The best way to get an ON_SubDEdgeIterator is so use the ON_SubD member function ON_SubDEdgeIterator eit = subd.EdgeIterator();
◆ ON_SubDEdgeIterator() [3/10]
 ON_SubDEdgeIterator::ON_SubDEdgeIterator  |  ( |  const class ON_SubD &  |  subd,
|  const class ON_SubDEdge &  |  edge
)
Construct and interator that iterates over a single edge.
◆ ON_SubDEdgeIterator() [4/10]
 ON_SubDEdgeIterator::ON_SubDEdgeIterator  |  ( |  const class ON_SubDRef &  |  subd_ref,
|  const class ON_SubDEdge &  |  edge
)
Construct and interator that iterates over a single edge.
◆ ON_SubDEdgeIterator() [5/10]
 ON_SubDEdgeIterator::ON_SubDEdgeIterator  |  ( |  const class ON_SubD &  |  subd,
|  const class ON_SubDVertex &  |  vertex
)
Construct and interator that iterates over the edges of a vertex.
◆ ON_SubDEdgeIterator() [6/10]
 ON_SubDEdgeIterator::ON_SubDEdgeIterator  |  ( |  const class ON_SubDRef &  |  subd_ref,
|  const class ON_SubDVertex &  |  vertex
)
Construct and interator that iterates over the edges of a vertex.
◆ ON_SubDEdgeIterator() [7/10]
 ON_SubDEdgeIterator::ON_SubDEdgeIterator  |  ( |  const class ON_SubD &  |  subd,
|  const class ON_SubDFace &  |  face
)
Construct and interator that iterates over the edges of a face.
◆ ON_SubDEdgeIterator() [8/10]
 ON_SubDEdgeIterator::ON_SubDEdgeIterator  |  ( |  const class ON_SubDRef &  |  subd_ref,
|  const class ON_SubDFace &  |  face
)
Construct and interator that iterates over the edges of a face.
◆ ON_SubDEdgeIterator() [9/10]
 ON_SubDEdgeIterator::ON_SubDEdgeIterator  |  ( |   | )
default
◆ ON_SubDEdgeIterator() [10/10]
 ON_SubDEdgeIterator::ON_SubDEdgeIterator  |  ( |  const ON_SubDEdgeIterator &  |   | )
default
Member Function Documentation
◆ CurrentEdge()
 const class ON_SubDEdge* ON_SubDEdgeIterator::CurrentEdge  |  ( |   | ) |   const
inline
Returns: Current edge;
◆ CurrentEdgeIndex()
 unsigned int ON_SubDEdgeIterator::CurrentEdgeIndex  |  ( |   | ) |   const
inline
Return: Interator index of the current edge.
◆ EdgeCount()
 unsigned int ON_SubDEdgeIterator::EdgeCount  |  ( |   | ) |   const
inline
Return: Number of edges this iterator will iterate through.
◆ FirstEdge()
 const class ON_SubDEdge* ON_SubDEdgeIterator::FirstEdge  |  ( |   | )
inline
Description: Set the iterator to the beginning of the edge list. Returns: First edge in the list.
◆ LastEdge()
 const class ON_SubDEdge* ON_SubDEdgeIterator::LastEdge  |  ( |   | )
inline
Description: Set the iterator to the end of the edge list. Returns: Last edge in the list.
◆ NextEdge()
 const class ON_SubDEdge* ON_SubDEdgeIterator::NextEdge  |  ( |   | )
inline
Description: Increment the iterator. Returns: Next edge. Remarks: operator++ and NextEdge() behave differently.
◆ operator++()
 const class ON_SubDEdge* ON_SubDEdgeIterator::operator++  |  ( |   | )
inline
Description: Increment the iterator. Returns: Current edge. Remarks: operator++ and NextEdge() behave differently.
◆ operator=()
 ON_SubDEdgeIterator& ON_SubDEdgeIterator::operator=  |  ( |  const ON_SubDEdgeIterator &  |   | )
default
◆ SubD()
 const class ON_SubD& ON_SubDEdgeIterator::SubD  |  ( |   | ) |   const
inline
Returns: The subD object for this iterator.
◆ SubDRef()
 const class ON_SubDRef& ON_SubDEdgeIterator::SubDRef  |  ( |   | ) |   const
inline