Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_3dPoint Class Reference
OpenNURBS
#include <opennurbs_point.h>
 Inheritance diagram for ON_3dPoint:
 Public Member Functions
ON_3dPoint ()=default
x,y,z not initialized More...
ON_3dPoint (const class ON_2fPoint &)
from 2f point More...
ON_3dPoint (const class ON_2fVector &)
from 2f point More...
ON_3dPoint (const class ON_3fPoint &)
from 3f point More...
ON_3dPoint (const class ON_3fVector &)
from 3f point More...
ON_3dPoint (const class ON_4fPoint &h)
from 4f point- h.w must be non-zero More...
ON_3dPoint (const double *)
from double[3] array More...
ON_3dPoint (const float *)
from float[3] array More...
ON_3dPoint (const ON_2dPoint &)
from 2d point More...
ON_3dPoint (const ON_2dVector &)
from 2d vector More...
ON_3dPoint (const ON_3dPoint &)=default
ON_3dPoint (const ON_3dVector &)
from 3d vector More...
ON_3dPoint (const ON_4dPoint &h)
from 4d point - h.w must be non-zero More...
ON_3dPoint (double x, double y, double z)
~ON_3dPoint ()=default
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
double  | DistanceTo (const ON_3dPoint &) const
double  | Fuzz (double tolerance=ON_ZERO_TOLERANCE) const
tolerance to use when comparing 3d points More...
bool  | IsNan () const
bool  | IsNotZero () const
bool  | IsUnset () const
bool  | IsUnsetOrNan () const
bool  | IsValid () const
bool  | IsZero () const
double  | MaximumCoordinate () const
absolute value of maximum coordinate More...
int  | MaximumCoordinateIndex () const
double  | MinimumCoordinate () const
absolute value of minimum coordinate More...
int  | MinimumCoordinateIndex () const
operator const double * () const
operator double * ()
(double*) conversion operators More...
bool  | operator!= (const ON_3dPoint &) const
double  | operator* (const ON_3dPoint &) const
dot product for points acting as vectors More...
double  | operator* (const ON_3dVector &) const
dot product for points acting as vectors More...
ON_3dPoint  | operator* (const ON_Xform &) const
ON_3dPoint  | operator* (double) const
ON_3dPoint  | operator* (float) const
ON_3dPoint  | operator* (int) const
ON_3dPoint &  | operator*= (double)
ON_3dPoint  | operator+ (const ON_2dPoint &) const
ON_3dPoint  | operator+ (const ON_2dVector &) const
ON_3dPoint  | operator+ (const ON_2fPoint &) const
ON_3dPoint  | operator+ (const ON_2fVector &) const
ON_3dPoint  | operator+ (const ON_3dPoint &) const
ON_3dPoint  | operator+ (const ON_3dVector &) const
ON_3dPoint  | operator+ (const ON_3fPoint &) const
ON_3dPoint  | operator+ (const ON_3fVector &) const
ON_3dPoint &  | operator+= (const ON_3dVector &)
ON_3dVector  | operator- (const ON_2dPoint &) const
ON_3dPoint  | operator- (const ON_2dVector &) const
ON_3dVector  | operator- (const ON_2fPoint &) const
ON_3dPoint  | operator- (const ON_2fVector &) const
ON_3dVector  | operator- (const ON_3dPoint &) const
ON_3dPoint  | operator- (const ON_3dVector &) const
ON_3dVector  | operator- (const ON_3fPoint &) const
ON_3dPoint  | operator- (const ON_3fVector &) const
ON_3dPoint &  | operator-= (const ON_3dVector &)
ON_3dPoint  | operator/ (double) const
ON_3dPoint  | operator/ (float) const
ON_3dPoint  | operator/ (int) const
ON_3dPoint &  | operator/= (double)
bool  | operator< (const ON_3dPoint &) const
bool  | operator<= (const ON_3dPoint &) const
dictionary order comparisons More...
ON_3dPoint &  | operator= (const class ON_2fPoint &)
ON_3dPoint &  | operator= (const class ON_2fVector &)
ON_3dPoint &  | operator= (const class ON_3fPoint &)
ON_3dPoint &  | operator= (const class ON_3fVector &)
ON_3dPoint &  | operator= (const class ON_4fPoint &)
ON_3dPoint &  | operator= (const double *)
point = double[3] support More...
ON_3dPoint &  | operator= (const float *)
point = float[3] support More...
ON_3dPoint &  | operator= (const ON_2dPoint &)
use implicit operator=(const ON_3dPoint&) More...
ON_3dPoint &  | operator= (const ON_2dVector &)
ON_3dPoint &  | operator= (const ON_3dPoint &)=default
ON_3dPoint &  | operator= (const ON_3dVector &)
ON_3dPoint &  | operator= (const ON_4dPoint &)
bool  | operator== (const ON_3dPoint &) const
bool  | operator> (const ON_3dPoint &) const
bool  | operator>= (const ON_3dPoint &) const
double &  | operator[] (int)
index operators mimic double[3] behavior More...
double  | operator[] (int) const
double &  | operator[] (unsigned int)
double  | operator[] (unsigned int) const
void  | Rotate (double angle, const ON_3dVector &axis, const ON_3dPoint &center)
void  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &axis, const ON_3dPoint &center)
void  | Set (double x, double y, double z)
set 3d point value More...
void  | Transform (const ON_Xform &)
void  | Zero ()
set all coordinates to zero; More...
 Static Public Member Functions
static int  | Compare (const ON_3dPoint &lhs, const ON_3dPoint &rhs)
static const ON_3dPoint  | Midpoint (const ON_3dPoint &A, const ON_3dPoint &B)
 Public Attributes
double  | x
double  | y
double  | z
 Static Public Attributes
static const ON_3dPoint  | NanPoint
(ON_DBL_QNAN,ON_DBL_QNAN,ON_DBL_QNAN) More...
static const ON_3dPoint  | Origin
(0.0,0.0,0.0) More...
static const ON_3dPoint  | UnsetPoint
(ON_UNSET_VALUE,ON_UNSET_VALUE,ON_UNSET_VALUE) More...
Detailed Description
ON_3dPoint