Public Member Functions | List of all members
ON_SubDFaceIterator Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
ON_SubDFaceIterator ()=default
ON_SubDFaceIterator (const class ON_SubD &subd)
ON_SubDFaceIterator (const class ON_SubD &subd, const class ON_SubDEdge &edge)
Construct and interator that iterates over the faces of an edge. More...
ON_SubDFaceIterator (const class ON_SubD &subd, const class ON_SubDFace &face)
Construct and interator that iterates over the single face. More...
ON_SubDFaceIterator (const class ON_SubD &subd, const class ON_SubDVertex &vertex)
Construct and interator that iterates over the faces of a vertex. More...
ON_SubDFaceIterator (const class ON_SubDRef &subd_ref)
ON_SubDFaceIterator (const class ON_SubDRef &subd_ref, const class ON_SubDEdge &edge)
Construct and interator that iterates over the faces of an edge. More...
ON_SubDFaceIterator (const class ON_SubDRef &subd_ref, const class ON_SubDFace &face)
Construct and interator that iterates over the single face. More...
ON_SubDFaceIterator (const class ON_SubDRef &subd_ref, const class ON_SubDVertex &vertex)
Construct and interator that iterates over the faces of a vertex. More...
ON_SubDFaceIterator (const ON_SubDFaceIterator &)=default
const class ON_SubDFace *  | CurrentFace () const
unsigned int  | CurrentFaceIndex () const
unsigned int  | FaceCount () const
const class ON_SubDFace *  | FirstFace ()
const class ON_SubDFace *  | LastFace ()
unsigned int  | MeshFragmentCount () const
const class ON_SubDFace *  | NextFace ()
const class ON_SubDFace *  | operator++ ()
ON_SubDFaceIterator &  | operator= (const ON_SubDFaceIterator &)=default
const class ON_SubD &  | SubD () const
const class ON_SubDRef &  | SubDRef () const
Detailed Description
ON_SubDFaceIterator
Constructor & Destructor Documentation
◆ ON_SubDFaceIterator() [1/10]
 ON_SubDFaceIterator::ON_SubDFaceIterator  |  ( |  const class ON_SubD &  |  subd | )
The best way to get an ON_SubDFaceIterator is so use the ON_SubD member function ON_SubDFaceIterator fit = subd.FaceIterator();
◆ ON_SubDFaceIterator() [2/10]
 ON_SubDFaceIterator::ON_SubDFaceIterator  |  ( |  const class ON_SubDRef &  |  subd_ref | )
The best way to get an ON_SubDFaceIterator is so use the ON_SubD member function ON_SubDFaceIterator fit = subd.FaceIterator();
◆ ON_SubDFaceIterator() [3/10]
 ON_SubDFaceIterator::ON_SubDFaceIterator  |  ( |  const class ON_SubD &  |  subd,
|  const class ON_SubDFace &  |  face
)
Construct and interator that iterates over the single face.
◆ ON_SubDFaceIterator() [4/10]
 ON_SubDFaceIterator::ON_SubDFaceIterator  |  ( |  const class ON_SubDRef &  |  subd_ref,
|  const class ON_SubDFace &  |  face
)
Construct and interator that iterates over the single face.
◆ ON_SubDFaceIterator() [5/10]
 ON_SubDFaceIterator::ON_SubDFaceIterator  |  ( |  const class ON_SubD &  |  subd,
|  const class ON_SubDVertex &  |  vertex
)
Construct and interator that iterates over the faces of a vertex.
◆ ON_SubDFaceIterator() [6/10]
 ON_SubDFaceIterator::ON_SubDFaceIterator  |  ( |  const class ON_SubDRef &  |  subd_ref,
|  const class ON_SubDVertex &  |  vertex
)
Construct and interator that iterates over the faces of a vertex.
◆ ON_SubDFaceIterator() [7/10]
 ON_SubDFaceIterator::ON_SubDFaceIterator  |  ( |  const class ON_SubD &  |  subd,
|  const class ON_SubDEdge &  |  edge
)
Construct and interator that iterates over the faces of an edge.
◆ ON_SubDFaceIterator() [8/10]
 ON_SubDFaceIterator::ON_SubDFaceIterator  |  ( |  const class ON_SubDRef &  |  subd_ref,
|  const class ON_SubDEdge &  |  edge
)
Construct and interator that iterates over the faces of an edge.
◆ ON_SubDFaceIterator() [9/10]
 ON_SubDFaceIterator::ON_SubDFaceIterator  |  ( |   | )
default
◆ ON_SubDFaceIterator() [10/10]
 ON_SubDFaceIterator::ON_SubDFaceIterator  |  ( |  const ON_SubDFaceIterator &  |   | )
default
Member Function Documentation
◆ CurrentFace()
 const class ON_SubDFace* ON_SubDFaceIterator::CurrentFace  |  ( |   | ) |   const
inline
Returns: Current face;
◆ CurrentFaceIndex()
 unsigned int ON_SubDFaceIterator::CurrentFaceIndex  |  ( |   | ) |   const
inline
Return: Interator index of the current face.
◆ FaceCount()
 unsigned int ON_SubDFaceIterator::FaceCount  |  ( |   | ) |   const
inline
Return: Number of faces this iterator will iterate through.
◆ FirstFace()
 const class ON_SubDFace* ON_SubDFaceIterator::FirstFace  |  ( |   | )
inline
Description: Set the iterator to the beginning of the face list. Returns: First face in the list.
◆ LastFace()
 const class ON_SubDFace* ON_SubDFaceIterator::LastFace  |  ( |   | )
inline
Description: Set the iterator to the end of the face list. Returns: Last face in the list.
◆ MeshFragmentCount()
 unsigned int ON_SubDFaceIterator::MeshFragmentCount  |  ( |   | ) |   const
◆ NextFace()
 const class ON_SubDFace* ON_SubDFaceIterator::NextFace  |  ( |   | )
inline
Description: Returns the next face and incrments the iterator. Returns: Next face. Remarks: operator++ and NextFace() behave differently.
◆ operator++()
 const class ON_SubDFace* ON_SubDFaceIterator::operator++  |  ( |   | )
inline
Description: Returns the current face and increment the iterator. Returns: Current face. Remarks: operator++ and NextFace() behave differently.
◆ operator=()
 ON_SubDFaceIterator& ON_SubDFaceIterator::operator=  |  ( |  const ON_SubDFaceIterator &  |   | )
default
◆ SubD()
 const class ON_SubD& ON_SubDFaceIterator::SubD  |  ( |   | ) |   const
inline
Returns: The subD object for this iterator.
◆ SubDRef()
 const class ON_SubDRef& ON_SubDFaceIterator::SubDRef  |  ( |   | ) |   const
inline