Public Member Functions | List of all members
ON_SubDComponentPtrPairHashTable Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Inheritance diagram for ON_SubDComponentPtrPairHashTable:
 Public Member Functions
ON_SubDComponentPtrPairHashTable ()
ON_SubDComponentPtrPairHashTable (const class ON_SubD &subd)
~ON_SubDComponentPtrPairHashTable ()=default
bool  | AddComponentPair (ON_SubDComponentPtr first_component, ON_SubDComponentPtr second_component)
bool  | AddEdgePair (const class ON_SubDEdge *first_e, const class ON_SubDEdge *second_e)
bool  | AddEdgePair (const class ON_SubDEdge *first_e, const ON_SubDEdgePtr second_eptr)
bool  | AddFacePair (const class ON_SubDFace *first_f, const class ON_SubDFace *second_f)
bool  | AddVertexPair (const class ON_SubDVertex *first_v, const class ON_SubDVertex *second_v)
const ON_SubDComponentPtrPair  | PairFromSecondComponentPtr (ON_SubDComponentPtr second_component)
const ON_SubDComponentPtrPair  | PairFromSecondEdge (const class ON_SubDEdge *second_e)
const ON_SubDComponentPtrPair  | PairFromSecondVertex (const class ON_SubDVertex *second_v)
Constructor & Destructor Documentation
◆ ON_SubDComponentPtrPairHashTable() [1/2]
 ON_SubDComponentPtrPairHashTable::ON_SubDComponentPtrPairHashTable  |  ( |   | )
◆ ON_SubDComponentPtrPairHashTable() [2/2]
 ON_SubDComponentPtrPairHashTable::ON_SubDComponentPtrPairHashTable  |  ( |  const class ON_SubD &  |  subd | )
◆ ~ON_SubDComponentPtrPairHashTable()
 ON_SubDComponentPtrPairHashTable::~ON_SubDComponentPtrPairHashTable  |  ( |   | )
default
Member Function Documentation
◆ AddComponentPair()
 bool ON_SubDComponentPtrPairHashTable::AddComponentPair  |  ( |  ON_SubDComponentPtr  |  first_component,
|  ON_SubDComponentPtr  |  second_component
)
◆ AddEdgePair() [1/2]
 bool ON_SubDComponentPtrPairHashTable::AddEdgePair  |  ( |  const class ON_SubDEdge *  |  first_e,
|  const class ON_SubDEdge *  |  second_e
)
◆ AddEdgePair() [2/2]
 bool ON_SubDComponentPtrPairHashTable::AddEdgePair  |  ( |  const class ON_SubDEdge *  |  first_e,
|  const ON_SubDEdgePtr  |  second_eptr
)
◆ AddFacePair()
 bool ON_SubDComponentPtrPairHashTable::AddFacePair  |  ( |  const class ON_SubDFace *  |  first_f,
|  const class ON_SubDFace *  |  second_f
)
◆ AddVertexPair()
 bool ON_SubDComponentPtrPairHashTable::AddVertexPair  |  ( |  const class ON_SubDVertex *  |  first_v,
|  const class ON_SubDVertex *  |  second_v
)
◆ PairFromSecondComponentPtr()
 const ON_SubDComponentPtrPair ON_SubDComponentPtrPairHashTable::PairFromSecondComponentPtr  |  ( |  ON_SubDComponentPtr  |  second_component | )
◆ PairFromSecondEdge()
 const ON_SubDComponentPtrPair ON_SubDComponentPtrPairHashTable::PairFromSecondEdge  |  ( |  const class ON_SubDEdge *  |  second_e | )
◆ PairFromSecondVertex()
 const ON_SubDComponentPtrPair ON_SubDComponentPtrPairHashTable::PairFromSecondVertex  |  ( |  const class ON_SubDVertex *  |  second_v | )