Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_3dVector Class Reference
OpenNURBS
#include <opennurbs_point.h>
 Public Member Functions
ON_3dVector ()=default
x,y,z not initialized More...
ON_3dVector (const double *)
from double[3] array More...
ON_3dVector (const float *)
from float[3] array More...
ON_3dVector (const ON_2dPoint &)
from 2d point More...
ON_3dVector (const ON_2dVector &)
from 2d vector More...
ON_3dVector (const ON_2fPoint &)
from 2f point More...
ON_3dVector (const ON_2fVector &)
from 2f vector More...
ON_3dVector (const ON_3dPoint &)
from 3d point More...
ON_3dVector (const ON_3dVector &)=default
ON_3dVector (const ON_3fPoint &)
from 3f point More...
ON_3dVector (const ON_3fVector &)
from 3f vector More...
ON_3dVector (double x, double y, double z)
~ON_3dVector ()=default
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
bool  | Decompose (const ON_3dVector &, const ON_3dVector &, const ON_3dVector &, double *, double *, double *) const
double  | Fuzz (double tolerance=ON_ZERO_TOLERANCE) const
tolerance to use when comparing 3d vectors More...
bool  | IsNan () const
bool  | IsNotZero () const
int  | IsParallelTo (const ON_3dVector &other, double angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE) const
bool  | IsPerpendicularTo (const ON_3dVector &other, double angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE) const
bool  | IsTiny (double tiny_tol=ON_ZERO_TOLERANCE) const
bool  | IsUnitVector () const
bool  | IsUnset () const
bool  | IsUnsetOrNan () const
bool  | IsValid () const
bool  | IsZero () const
double  | Length () const
double  | LengthAndUnitize ()
unitizes and returns initial length More...
double  | LengthSquared () const
double  | MaximumCoordinate () const
absolute value of maximum coordinate More...
int  | MaximumCoordinateIndex () const
double  | MinimumCoordinate () const
absolute value of minimum coordinate More...
int  | MinimumCoordinateIndex () const
operator const double * () const
operator double * ()
(double*) conversion operators More...
bool  | operator!= (const ON_3dVector &) const
double  | operator* (const ON_3dPoint &) const
inner (dot) product More...
double  | operator* (const ON_3dVector &) const
DO NOT ADD ANY MORE overrides of += or -=. More...
double  | operator* (const ON_3fVector &) const
inner (dot) product More...
ON_3dVector  | operator* (const ON_Xform &) const
ON_3dVector  | operator* (double) const
ON_3dVector  | operator* (float) const
ON_3dVector  | operator* (int) const
ON_3dVector &  | operator*= (double)
ON_3dPoint  | operator+ (const ON_2dPoint &) const
ON_3dVector  | operator+ (const ON_2dVector &) const
ON_3dPoint  | operator+ (const ON_2fPoint &) const
ON_3dVector  | operator+ (const ON_2fVector &) const
ON_3dPoint  | operator+ (const ON_3dPoint &) const
ON_3dVector  | operator+ (const ON_3dVector &) const
ON_3dPoint  | operator+ (const ON_3fPoint &) const
ON_3dVector  | operator+ (const ON_3fVector &) const
ON_3dVector &  | operator+= (const ON_3dVector &)
ON_3dVector  | operator- () const
ON_3dPoint  | operator- (const ON_2dPoint &) const
ON_3dVector  | operator- (const ON_2dVector &) const
ON_3dPoint  | operator- (const ON_2fPoint &) const
ON_3dVector  | operator- (const ON_2fVector &) const
ON_3dPoint  | operator- (const ON_3dPoint &) const
ON_3dVector  | operator- (const ON_3dVector &) const
ON_3dPoint  | operator- (const ON_3fPoint &) const
ON_3dVector  | operator- (const ON_3fVector &) const
ON_3dVector &  | operator-= (const ON_3dVector &)
ON_3dVector  | operator/ (double) const
ON_3dVector  | operator/ (float) const
ON_3dVector  | operator/ (int) const
ON_3dVector &  | operator/= (double)
bool  | operator< (const ON_3dVector &) const
bool  | operator<= (const ON_3dVector &) const
dictionary order comparisons More...
ON_3dVector &  | operator= (const double *)
vector = double[3] support More...
ON_3dVector &  | operator= (const float *)
vector = float[3] support More...
ON_3dVector &  | operator= (const ON_2dPoint &)
ON_3dVector &  | operator= (const ON_2dVector &)
use implicit operator=(const ON_3dVector&) More...
ON_3dVector &  | operator= (const ON_2fPoint &)
ON_3dVector &  | operator= (const ON_2fVector &)
ON_3dVector &  | operator= (const ON_3dPoint &)
ON_3dVector &  | operator= (const ON_3dVector &)=default
ON_3dVector &  | operator= (const ON_3fPoint &)
ON_3dVector &  | operator= (const ON_3fVector &)
bool  | operator== (const ON_3dVector &) const
bool  | operator> (const ON_3dVector &) const
bool  | operator>= (const ON_3dVector &) const
double &  | operator[] (int)
index operators mimic double[3] behavior More...
double  | operator[] (int) const
double &  | operator[] (unsigned int)
double  | operator[] (unsigned int) const
bool  | PerpendicularTo (const ON_3dPoint &, const ON_3dPoint &, const ON_3dPoint &)
set this vector to be perpendicular to a plane defined by 3 points More...
bool  | PerpendicularTo (const ON_3dVector &)
set this vector to be perpendicular to another vector More...
void  | Reverse ()
negate all coordinates More...
void  | Rotate (double angle, const ON_3dVector &axis)
void  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &axis)
void  | Set (double x, double y, double z)
set 3d vector value More...
void  | Transform (const ON_Xform &)
bool  | Unitize ()
returns false if vector has zero length More...
ON_3dVector  | UnitVector () const
void  | Zero ()
set all coordinates to zero; More...
 Static Public Member Functions
static int  | Compare (const ON_3dVector &lhs, const ON_3dVector &rhs)
static const ON_3dVector &  | UnitVector (int)
 Public Attributes
double  | x
double  | y
double  | z
 Static Public Attributes
static const ON_3dVector  | NanVector
(ON_DBL_QNAN,ON_DBL_QNAN,ON_DBL_QNAN) More...
static const ON_3dVector  | UnsetVector
(ON_UNSET_VALUE,ON_UNSET_VALUE,ON_UNSET_VALUE) More...
static const ON_3dVector  | XAxis
(1.0,0.0,0.0) More...
static const ON_3dVector  | YAxis
(0.0,1.0,0.0) More...
static const ON_3dVector  | ZAxis
(0.0,0.0,1.0) More...
static const ON_3dVector  | ZeroVector
(0.0,0.0,0.0) More...
Detailed Description
ON_3dVector