Public Member Functions | List of all members
CRhRdkTinyIcon Class Reference
RDK
#include <RhRdkUiSdk.h>
 Inheritance diagram for CRhRdkTinyIcon:
 Public Member Functions
void  | CopyFrom (const IRhRdkTinyIcons::IIcon &icon)
virtual const CRhinoDib &  | Dib (void) const override
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData) override
virtual ON_4iRect  | Rect (void) const override
void  | SetDib (const CRhinoDib &dib)
void  | SetRect (const ON_4iRect &rect)
void  | SetToolTip (const wchar_t *wsz)
virtual ON_wString  | ToolTip (void) const override
 Additional Inherited Members
 Protected Member Functions inherited from IRhRdkTinyIcons::IIcon
virtual  | ~IIcon ()
Member Function Documentation
◆ CopyFrom()
 void CRhRdkTinyIcon::CopyFrom  |  ( |  const IRhRdkTinyIcons::IIcon &  |  icon | )
◆ Dib()
 virtual const CRhinoDib& CRhRdkTinyIcon::Dib  |  ( |  void  |   | ) |   const
overridevirtual
Implements IRhRdkTinyIcons::IIcon.
◆ EVF()
 virtual void* CRhRdkTinyIcon::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
inlineoverridevirtual
Emergency virtual function for future expansion.
Implements IRhRdkTinyIcons::IIcon.
◆ Rect()
 virtual ON_4iRect CRhRdkTinyIcon::Rect  |  ( |  void  |   | ) |   const
overridevirtual
Implements IRhRdkTinyIcons::IIcon.
◆ SetDib()
 void CRhRdkTinyIcon::SetDib  |  ( |  const CRhinoDib &  |  dib | )
◆ SetRect()
 void CRhRdkTinyIcon::SetRect  |  ( |  const ON_4iRect &  |  rect | )
◆ SetToolTip()
 void CRhRdkTinyIcon::SetToolTip  |  ( |  const wchar_t *  |  wsz | )
◆ ToolTip()
 virtual ON_wString CRhRdkTinyIcon::ToolTip  |  ( |  void  |   | ) |   const
overridevirtual
Implements IRhRdkTinyIcons::IIcon.