Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_4dPoint Class Reference
OpenNURBS
#include <opennurbs_point.h>
 Public Member Functions
ON_4dPoint ()=default
x,y,z,w not initialized More...
ON_4dPoint (const double *)
from double[4] array More...
ON_4dPoint (const float *)
from float[4] array More...
ON_4dPoint (const ON_2dPoint &)
These constructors are not explicit because no informtion is lost. More...
ON_4dPoint (const ON_2dVector &)
from 2d vector (x,y,0,0) More...
ON_4dPoint (const ON_2fPoint &)
These constructors are not explicit because no informtion is lost. More...
ON_4dPoint (const ON_2fVector &)
from 2f vector (z,y,0,0) More...
ON_4dPoint (const ON_3dPoint &)
from 3d point (x,y,z,1) More...
ON_4dPoint (const ON_3dVector &)
from 3d vector (x,y,z,0) More...
ON_4dPoint (const ON_3fPoint &)
from 3f point (x,y,z,1) More...
ON_4dPoint (const ON_3fVector &)
from 3f vector (x,y,z,0) More...
ON_4dPoint (const ON_4dPoint &)=default
ON_4dPoint (const ON_4fPoint &)
from 4f point More...
ON_4dPoint (double x, double y, double z, double w)
~ON_4dPoint ()=default
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
double  | EuclideanX () const
double  | EuclideanY () const
double  | EuclideanZ () const
bool  | IsNan () const
bool  | IsUnset () const
bool  | IsUnsetOrNan () const
bool  | IsValid () const
double  | MaximumCoordinate () const
absolute value of maximum coordinate More...
int  | MaximumCoordinateIndex () const
double  | MinimumCoordinate () const
absolute value of minimum coordinate More...
int  | MinimumCoordinateIndex () const
bool  | Normalize ()
set so x^2 + y^2 + z^2 + w^2 = 1 More...
operator const double * () const
operator double * ()
(double*) conversion operators More...
bool  | operator!= (const ON_4dPoint &rhs) const
ON_4dPoint  | operator* (const ON_Xform &) const
ON_4dPoint  | operator* (double) const
ON_4dPoint &  | operator*= (double)
ON_4dPoint  | operator+ (const ON_4dPoint &) const
sum w = sqrt(|w1*w2|) More...
ON_4dPoint &  | operator+= (const ON_4dPoint &)
sum w = sqrt(|w1*w2|) More...
ON_4dPoint  | operator- (const ON_4dPoint &) const
difference w = sqrt(|w1*w2|) More...
ON_4dPoint &  | operator-= (const ON_4dPoint &)
difference w = sqrt(|w1*w2|) More...
ON_4dPoint  | operator/ (double) const
ON_4dPoint &  | operator/= (double)
ON_4dPoint &  | operator= (const class ON_2fPoint &)
ON_4dPoint &  | operator= (const class ON_2fVector &)
ON_4dPoint &  | operator= (const class ON_3fPoint &)
ON_4dPoint &  | operator= (const class ON_3fVector &)
ON_4dPoint &  | operator= (const class ON_4fPoint &)
ON_4dPoint &  | operator= (const double *)
point = double[4] support More...
ON_4dPoint &  | operator= (const float *)
point = float[4] support More...
ON_4dPoint &  | operator= (const ON_2dPoint &)
use implicit operator=(const ON_4dPoint&) More...
ON_4dPoint &  | operator= (const ON_2dVector &)
ON_4dPoint &  | operator= (const ON_3dPoint &)
ON_4dPoint &  | operator= (const ON_3dVector &)
ON_4dPoint &  | operator= (const ON_4dPoint &)=default
bool  | operator== (const ON_4dPoint &rhs) const
double &  | operator[] (int)
index operators mimic double[4] behavior More...
double  | operator[] (int) const
double &  | operator[] (unsigned int)
double  | operator[] (unsigned int) const
void  | Set (double x, double y, double z, double w)
set 4d point value More...
void  | Transform (const ON_Xform &)
 Static Public Member Functions
static int  | DictionaryCompare (const ON_4dPoint &lhs, const ON_4dPoint &rhs)
static double  | InnerProduct (const ON_4dPoint &lhs, const ON_4dPoint &rhs)
static int  | ProjectiveCompare (const ON_4dPoint &lhs, const ON_4dPoint &rhs)
 Public Attributes
double  | w
double  | x
double  | y
double  | z
 Static Public Attributes
static const ON_4dPoint  | Nan
(ON_DBL_QNAN,ON_DBL_QNAN,ON_DBL_QNAN,ON_DBL_QNAN) More...
static const ON_4dPoint  | Zero
(0,0,0,0) More...
Detailed Description
ON_4dPoint (homogeneous coordinates)